MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: RPINR12_13
#define RPINR12_13 RPINR12_13
extern volatile unsigned char           RPINR12_13          __at(0xE30);
#ifndef _LIB_BUILD
asm("RPINR12_13 equ 0E30h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SDI2R                  :4;
        unsigned SS2R                   :4;
    };
    struct {
        unsigned SDI2R0                 :1;
        unsigned SDI2R1                 :1;
        unsigned SDI2R2                 :1;
        unsigned SDI2R3                 :1;
        unsigned SS2R0                  :1;
        unsigned SS2R1                  :1;
        unsigned SS2R2                  :1;
        unsigned SS2R3                  :1;
    };
} RPINR12_13bits_t;
extern volatile RPINR12_13bits_t RPINR12_13bits __at(0xE30);
// bitfield macros
#define _RPINR12_13_SDI2R_POSN                              0x0
#define _RPINR12_13_SDI2R_POSITION                          0x0
#define _RPINR12_13_SDI2R_SIZE                              0x4
#define _RPINR12_13_SDI2R_LENGTH                            0x4
#define _RPINR12_13_SDI2R_MASK                              0xF
#define _RPINR12_13_SS2R_POSN                               0x4
#define _RPINR12_13_SS2R_POSITION                           0x4
#define _RPINR12_13_SS2R_SIZE                               0x4
#define _RPINR12_13_SS2R_LENGTH                             0x4
#define _RPINR12_13_SS2R_MASK                               0xF0
#define _RPINR12_13_SDI2R0_POSN                             0x0
#define _RPINR12_13_SDI2R0_POSITION                         0x0
#define _RPINR12_13_SDI2R0_SIZE                             0x1
#define _RPINR12_13_SDI2R0_LENGTH                           0x1
#define _RPINR12_13_SDI2R0_MASK                             0x1
#define _RPINR12_13_SDI2R1_POSN                             0x1
#define _RPINR12_13_SDI2R1_POSITION                         0x1
#define _RPINR12_13_SDI2R1_SIZE                             0x1
#define _RPINR12_13_SDI2R1_LENGTH                           0x1
#define _RPINR12_13_SDI2R1_MASK                             0x2
#define _RPINR12_13_SDI2R2_POSN                             0x2
#define _RPINR12_13_SDI2R2_POSITION                         0x2
#define _RPINR12_13_SDI2R2_SIZE                             0x1
#define _RPINR12_13_SDI2R2_LENGTH                           0x1
#define _RPINR12_13_SDI2R2_MASK                             0x4
#define _RPINR12_13_SDI2R3_POSN                             0x3
#define _RPINR12_13_SDI2R3_POSITION                         0x3
#define _RPINR12_13_SDI2R3_SIZE                             0x1
#define _RPINR12_13_SDI2R3_LENGTH                           0x1
#define _RPINR12_13_SDI2R3_MASK                             0x8
#define _RPINR12_13_SS2R0_POSN                              0x4
#define _RPINR12_13_SS2R0_POSITION                          0x4
#define _RPINR12_13_SS2R0_SIZE                              0x1
#define _RPINR12_13_SS2R0_LENGTH                            0x1
#define _RPINR12_13_SS2R0_MASK                              0x10
#define _RPINR12_13_SS2R1_POSN                              0x5
#define _RPINR12_13_SS2R1_POSITION                          0x5
#define _RPINR12_13_SS2R1_SIZE                              0x1
#define _RPINR12_13_SS2R1_LENGTH                            0x1
#define _RPINR12_13_SS2R1_MASK                              0x20
#define _RPINR12_13_SS2R2_POSN                              0x6
#define _RPINR12_13_SS2R2_POSITION                          0x6
#define _RPINR12_13_SS2R2_SIZE                              0x1
#define _RPINR12_13_SS2R2_LENGTH                            0x1
#define _RPINR12_13_SS2R2_MASK                              0x40
#define _RPINR12_13_SS2R3_POSN                              0x7
#define _RPINR12_13_SS2R3_POSITION                          0x7
#define _RPINR12_13_SS2R3_SIZE                              0x1
#define _RPINR12_13_SS2R3_LENGTH                            0x1
#define _RPINR12_13_SS2R3_MASK                              0x80

// Register: RPINR14_15
#define RPINR14_15 RPINR14_15
extern volatile unsigned char           RPINR14_15          __at(0xE31);
#ifndef _LIB_BUILD
asm("RPINR14_15 equ 0E31h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FLT0R                  :4;
        unsigned ECCP1R                 :4;
    };
    struct {
        unsigned FLT0R0                 :1;
        unsigned FLT0R1                 :1;
        unsigned FLT0R2                 :1;
        unsigned FLT0R3                 :1;
        unsigned ECCP1R0                :1;
        unsigned ECCP1R1                :1;
        unsigned ECCP1R2                :1;
        unsigned ECCP1R3                :1;
    };
} RPINR14_15bits_t;
extern volatile RPINR14_15bits_t RPINR14_15bits __at(0xE31);
// bitfield macros
#define _RPINR14_15_FLT0R_POSN                              0x0
#define _RPINR14_15_FLT0R_POSITION                          0x0
#define _RPINR14_15_FLT0R_SIZE                              0x4
#define _RPINR14_15_FLT0R_LENGTH                            0x4
#define _RPINR14_15_FLT0R_MASK                              0xF
#define _RPINR14_15_ECCP1R_POSN                             0x4
#define _RPINR14_15_ECCP1R_POSITION                         0x4
#define _RPINR14_15_ECCP1R_SIZE                             0x4
#define _RPINR14_15_ECCP1R_LENGTH                           0x4
#define _RPINR14_15_ECCP1R_MASK                             0xF0
#define _RPINR14_15_FLT0R0_POSN                             0x0
#define _RPINR14_15_FLT0R0_POSITION                         0x0
#define _RPINR14_15_FLT0R0_SIZE                             0x1
#define _RPINR14_15_FLT0R0_LENGTH                           0x1
#define _RPINR14_15_FLT0R0_MASK                             0x1
#define _RPINR14_15_FLT0R1_POSN                             0x1
#define _RPINR14_15_FLT0R1_POSITION                         0x1
#define _RPINR14_15_FLT0R1_SIZE                             0x1
#define _RPINR14_15_FLT0R1_LENGTH                           0x1
#define _RPINR14_15_FLT0R1_MASK                             0x2
#define _RPINR14_15_FLT0R2_POSN                             0x2
#define _RPINR14_15_FLT0R2_POSITION                         0x2
#define _RPINR14_15_FLT0R2_SIZE                             0x1
#define _RPINR14_15_FLT0R2_LENGTH                           0x1
#define _RPINR14_15_FLT0R2_MASK                             0x4
#define _RPINR14_15_FLT0R3_POSN                             0x3
#define _RPINR14_15_FLT0R3_POSITION                         0x3
#define _RPINR14_15_FLT0R3_SIZE                             0x1
#define _RPINR14_15_FLT0R3_LENGTH                           0x1
#define _RPINR14_15_FLT0R3_MASK                             0x8
#define _RPINR14_15_ECCP1R0_POSN                            0x4
#define _RPINR14_15_ECCP1R0_POSITION                        0x4
#define _RPINR14_15_ECCP1R0_SIZE                            0x1
#define _RPINR14_15_ECCP1R0_LENGTH                          0x1
#define _RPINR14_15_ECCP1R0_MASK                            0x10
#define _RPINR14_15_ECCP1R1_POSN                            0x5
#define _RPINR14_15_ECCP1R1_POSITION                        0x5
#define _RPINR14_15_ECCP1R1_SIZE                            0x1
#define _RPINR14_15_ECCP1R1_LENGTH                          0x1
#define _RPINR14_15_ECCP1R1_MASK                            0x20
#define _RPINR14_15_ECCP1R2_POSN                            0x6
#define _RPINR14_15_ECCP1R2_POSITION                        0x6
#define _RPINR14_15_ECCP1R2_SIZE                            0x1
#define _RPINR14_15_ECCP1R2_LENGTH                          0x1
#define _RPINR14_15_ECCP1R2_MASK                            0x40
#define _RPINR14_15_ECCP1R3_POSN                            0x7
#define _RPINR14_15_ECCP1R3_POSITION                        0x7
#define _RPINR14_15_ECCP1R3_SIZE                            0x1
#define _RPINR14_15_ECCP1R3_LENGTH                          0x1
#define _RPINR14_15_ECCP1R3_MASK                            0x80

// Register: RPINR16_17
#define RPINR16_17 RPINR16_17
extern volatile unsigned char           RPINR16_17          __at(0xE32);
#ifndef _LIB_BUILD
asm("RPINR16_17 equ 0E32h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP2R                 :4;
        unsigned ECCP3R                 :4;
    };
    struct {
        unsigned ECCP2R0                :1;
        unsigned ECCP2R1                :1;
        unsigned ECCP2R2                :1;
        unsigned ECCP2R3                :1;
        unsigned ECCP3R0                :1;
        unsigned ECCP3R1                :1;
        unsigned ECCP3R2                :1;
        unsigned ECCP3R3                :1;
    };
} RPINR16_17bits_t;
extern volatile RPINR16_17bits_t RPINR16_17bits __at(0xE32);
// bitfield macros
#define _RPINR16_17_ECCP2R_POSN                             0x0
#define _RPINR16_17_ECCP2R_POSITION                         0x0
#define _RPINR16_17_ECCP2R_SIZE                             0x4
#define _RPINR16_17_ECCP2R_LENGTH                           0x4
#define _RPINR16_17_ECCP2R_MASK                             0xF
#define _RPINR16_17_ECCP3R_POSN                             0x4
#define _RPINR16_17_ECCP3R_POSITION                         0x4
#define _RPINR16_17_ECCP3R_SIZE                             0x4
#define _RPINR16_17_ECCP3R_LENGTH                           0x4
#define _RPINR16_17_ECCP3R_MASK                             0xF0
#define _RPINR16_17_ECCP2R0_POSN                            0x0
#define _RPINR16_17_ECCP2R0_POSITION                        0x0
#define _RPINR16_17_ECCP2R0_SIZE                            0x1
#define _RPINR16_17_ECCP2R0_LENGTH                          0x1
#define _RPINR16_17_ECCP2R0_MASK                            0x1
#define _RPINR16_17_ECCP2R1_POSN                            0x1
#define _RPINR16_17_ECCP2R1_POSITION                        0x1
#define _RPINR16_17_ECCP2R1_SIZE                            0x1
#define _RPINR16_17_ECCP2R1_LENGTH                          0x1
#define _RPINR16_17_ECCP2R1_MASK                            0x2
#define _RPINR16_17_ECCP2R2_POSN                            0x2
#define _RPINR16_17_ECCP2R2_POSITION                        0x2
#define _RPINR16_17_ECCP2R2_SIZE                            0x1
#define _RPINR16_17_ECCP2R2_LENGTH                          0x1
#define _RPINR16_17_ECCP2R2_MASK                            0x4
#define _RPINR16_17_ECCP2R3_POSN                            0x3
#define _RPINR16_17_ECCP2R3_POSITION                        0x3
#define _RPINR16_17_ECCP2R3_SIZE                            0x1
#define _RPINR16_17_ECCP2R3_LENGTH                          0x1
#define _RPINR16_17_ECCP2R3_MASK                            0x8
#define _RPINR16_17_ECCP3R0_POSN                            0x4
#define _RPINR16_17_ECCP3R0_POSITION                        0x4
#define _RPINR16_17_ECCP3R0_SIZE                            0x1
#define _RPINR16_17_ECCP3R0_LENGTH                          0x1
#define _RPINR16_17_ECCP3R0_MASK                            0x10
#define _RPINR16_17_ECCP3R1_POSN                            0x5
#define _RPINR16_17_ECCP3R1_POSITION                        0x5
#define _RPINR16_17_ECCP3R1_SIZE                            0x1
#define _RPINR16_17_ECCP3R1_LENGTH                          0x1
#define _RPINR16_17_ECCP3R1_MASK                            0x20
#define _RPINR16_17_ECCP3R2_POSN                            0x6
#define _RPINR16_17_ECCP3R2_POSITION                        0x6
#define _RPINR16_17_ECCP3R2_SIZE                            0x1
#define _RPINR16_17_ECCP3R2_LENGTH                          0x1
#define _RPINR16_17_ECCP3R2_MASK                            0x40
#define _RPINR16_17_ECCP3R3_POSN                            0x7
#define _RPINR16_17_ECCP3R3_POSITION                        0x7
#define _RPINR16_17_ECCP3R3_SIZE                            0x1
#define _RPINR16_17_ECCP3R3_LENGTH                          0x1
#define _RPINR16_17_ECCP3R3_MASK                            0x80

// Register: RPINR18_19
#define RPINR18_19 RPINR18_19
extern volatile unsigned char           RPINR18_19          __at(0xE33);
#ifndef _LIB_BUILD
asm("RPINR18_19 equ 0E33h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOC0R                  :4;
        unsigned IOC1R                  :4;
    };
    struct {
        unsigned IOC0R0                 :1;
        unsigned IOC0R1                 :1;
        unsigned IOC0R2                 :1;
        unsigned IOC0R3                 :1;
        unsigned IOC1R0                 :1;
        unsigned IOC1R1                 :1;
        unsigned IOC1R2                 :1;
        unsigned IOC1R3                 :1;
    };
} RPINR18_19bits_t;
extern volatile RPINR18_19bits_t RPINR18_19bits __at(0xE33);
// bitfield macros
#define _RPINR18_19_IOC0R_POSN                              0x0
#define _RPINR18_19_IOC0R_POSITION                          0x0
#define _RPINR18_19_IOC0R_SIZE                              0x4
#define _RPINR18_19_IOC0R_LENGTH                            0x4
#define _RPINR18_19_IOC0R_MASK                              0xF
#define _RPINR18_19_IOC1R_POSN                              0x4
#define _RPINR18_19_IOC1R_POSITION                          0x4
#define _RPINR18_19_IOC1R_SIZE                              0x4
#define _RPINR18_19_IOC1R_LENGTH                            0x4
#define _RPINR18_19_IOC1R_MASK                              0xF0
#define _RPINR18_19_IOC0R0_POSN                             0x0
#define _RPINR18_19_IOC0R0_POSITION                         0x0
#define _RPINR18_19_IOC0R0_SIZE                             0x1
#define _RPINR18_19_IOC0R0_LENGTH                           0x1
#define _RPINR18_19_IOC0R0_MASK                             0x1
#define _RPINR18_19_IOC0R1_POSN                             0x1
#define _RPINR18_19_IOC0R1_POSITION                         0x1
#define _RPINR18_19_IOC0R1_SIZE                             0x1
#define _RPINR18_19_IOC0R1_LENGTH                           0x1
#define _RPINR18_19_IOC0R1_MASK                             0x2
#define _RPINR18_19_IOC0R2_POSN                             0x2
#define _RPINR18_19_IOC0R2_POSITION                         0x2
#define _RPINR18_19_IOC0R2_SIZE                             0x1
#define _RPINR18_19_IOC0R2_LENGTH                           0x1
#define _RPINR18_19_IOC0R2_MASK                             0x4
#define _RPINR18_19_IOC0R3_POSN                             0x3
#define _RPINR18_19_IOC0R3_POSITION                         0x3
#define _RPINR18_19_IOC0R3_SIZE                             0x1
#define _RPINR18_19_IOC0R3_LENGTH                           0x1
#define _RPINR18_19_IOC0R3_MASK                             0x8
#define _RPINR18_19_IOC1R0_POSN                             0x4
#define _RPINR18_19_IOC1R0_POSITION                         0x4
#define _RPINR18_19_IOC1R0_SIZE                             0x1
#define _RPINR18_19_IOC1R0_LENGTH                           0x1
#define _RPINR18_19_IOC1R0_MASK                             0x10
#define _RPINR18_19_IOC1R1_POSN                             0x5
#define _RPINR18_19_IOC1R1_POSITION                         0x5
#define _RPINR18_19_IOC1R1_SIZE                             0x1
#define _RPINR18_19_IOC1R1_LENGTH                           0x1
#define _RPINR18_19_IOC1R1_MASK                             0x20
#define _RPINR18_19_IOC1R2_POSN                             0x6
#define _RPINR18_19_IOC1R2_POSITION                         0x6
#define _RPINR18_19_IOC1R2_SIZE                             0x1
#define _RPINR18_19_IOC1R2_LENGTH                           0x1
#define _RPINR18_19_IOC1R2_MASK                             0x40
#define _RPINR18_19_IOC1R3_POSN                             0x7
#define _RPINR18_19_IOC1R3_POSITION                         0x7
#define _RPINR18_19_IOC1R3_SIZE                             0x1
#define _RPINR18_19_IOC1R3_LENGTH                           0x1
#define _RPINR18_19_IOC1R3_MASK                             0x80

