MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: RPINR44_45
#define RPINR44_45 RPINR44_45
extern volatile unsigned char           RPINR44_45          __at(0xE40);
#ifndef _LIB_BUILD
asm("RPINR44_45 equ 0E40h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T5GR                   :4;
        unsigned T5CKIR                 :4;
    };
    struct {
        unsigned T5GR0                  :1;
        unsigned T5GR1                  :1;
        unsigned T5GR2                  :1;
        unsigned T5GR3                  :1;
        unsigned T5CKIR0                :1;
        unsigned T5CKIR1                :1;
        unsigned T5CKIR2                :1;
        unsigned T5CKIR3                :1;
    };
} RPINR44_45bits_t;
extern volatile RPINR44_45bits_t RPINR44_45bits __at(0xE40);
// bitfield macros
#define _RPINR44_45_T5GR_POSN                               0x0
#define _RPINR44_45_T5GR_POSITION                           0x0
#define _RPINR44_45_T5GR_SIZE                               0x4
#define _RPINR44_45_T5GR_LENGTH                             0x4
#define _RPINR44_45_T5GR_MASK                               0xF
#define _RPINR44_45_T5CKIR_POSN                             0x4
#define _RPINR44_45_T5CKIR_POSITION                         0x4
#define _RPINR44_45_T5CKIR_SIZE                             0x4
#define _RPINR44_45_T5CKIR_LENGTH                           0x4
#define _RPINR44_45_T5CKIR_MASK                             0xF0
#define _RPINR44_45_T5GR0_POSN                              0x0
#define _RPINR44_45_T5GR0_POSITION                          0x0
#define _RPINR44_45_T5GR0_SIZE                              0x1
#define _RPINR44_45_T5GR0_LENGTH                            0x1
#define _RPINR44_45_T5GR0_MASK                              0x1
#define _RPINR44_45_T5GR1_POSN                              0x1
#define _RPINR44_45_T5GR1_POSITION                          0x1
#define _RPINR44_45_T5GR1_SIZE                              0x1
#define _RPINR44_45_T5GR1_LENGTH                            0x1
#define _RPINR44_45_T5GR1_MASK                              0x2
#define _RPINR44_45_T5GR2_POSN                              0x2
#define _RPINR44_45_T5GR2_POSITION                          0x2
#define _RPINR44_45_T5GR2_SIZE                              0x1
#define _RPINR44_45_T5GR2_LENGTH                            0x1
#define _RPINR44_45_T5GR2_MASK                              0x4
#define _RPINR44_45_T5GR3_POSN                              0x3
#define _RPINR44_45_T5GR3_POSITION                          0x3
#define _RPINR44_45_T5GR3_SIZE                              0x1
#define _RPINR44_45_T5GR3_LENGTH                            0x1
#define _RPINR44_45_T5GR3_MASK                              0x8
#define _RPINR44_45_T5CKIR0_POSN                            0x4
#define _RPINR44_45_T5CKIR0_POSITION                        0x4
#define _RPINR44_45_T5CKIR0_SIZE                            0x1
#define _RPINR44_45_T5CKIR0_LENGTH                          0x1
#define _RPINR44_45_T5CKIR0_MASK                            0x10
#define _RPINR44_45_T5CKIR1_POSN                            0x5
#define _RPINR44_45_T5CKIR1_POSITION                        0x5
#define _RPINR44_45_T5CKIR1_SIZE                            0x1
#define _RPINR44_45_T5CKIR1_LENGTH                          0x1
#define _RPINR44_45_T5CKIR1_MASK                            0x20
#define _RPINR44_45_T5CKIR2_POSN                            0x6
#define _RPINR44_45_T5CKIR2_POSITION                        0x6
#define _RPINR44_45_T5CKIR2_SIZE                            0x1
#define _RPINR44_45_T5CKIR2_LENGTH                          0x1
#define _RPINR44_45_T5CKIR2_MASK                            0x40
#define _RPINR44_45_T5CKIR3_POSN                            0x7
#define _RPINR44_45_T5CKIR3_POSITION                        0x7
#define _RPINR44_45_T5CKIR3_SIZE                            0x1
#define _RPINR44_45_T5CKIR3_LENGTH                          0x1
#define _RPINR44_45_T5CKIR3_MASK                            0x80

// Register: RPINR46_47
#define RPINR46_47 RPINR46_47
extern volatile unsigned char           RPINR46_47          __at(0xE41);
#ifndef _LIB_BUILD
asm("RPINR46_47 equ 0E41h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PBIO0R                 :4;
        unsigned PBIO1R                 :4;
    };
    struct {
        unsigned PBIO0R0                :1;
        unsigned PBIO0R1                :1;
        unsigned PBIO0R2                :1;
        unsigned PBIO0R3                :1;
        unsigned PBIO1R0                :1;
        unsigned PBIO1R1                :1;
        unsigned PBIO1R2                :1;
        unsigned PBIO1R3                :1;
    };
} RPINR46_47bits_t;
extern volatile RPINR46_47bits_t RPINR46_47bits __at(0xE41);
// bitfield macros
#define _RPINR46_47_PBIO0R_POSN                             0x0
#define _RPINR46_47_PBIO0R_POSITION                         0x0
#define _RPINR46_47_PBIO0R_SIZE                             0x4
#define _RPINR46_47_PBIO0R_LENGTH                           0x4
#define _RPINR46_47_PBIO0R_MASK                             0xF
#define _RPINR46_47_PBIO1R_POSN                             0x4
#define _RPINR46_47_PBIO1R_POSITION                         0x4
#define _RPINR46_47_PBIO1R_SIZE                             0x4
#define _RPINR46_47_PBIO1R_LENGTH                           0x4
#define _RPINR46_47_PBIO1R_MASK                             0xF0
#define _RPINR46_47_PBIO0R0_POSN                            0x0
#define _RPINR46_47_PBIO0R0_POSITION                        0x0
#define _RPINR46_47_PBIO0R0_SIZE                            0x1
#define _RPINR46_47_PBIO0R0_LENGTH                          0x1
#define _RPINR46_47_PBIO0R0_MASK                            0x1
#define _RPINR46_47_PBIO0R1_POSN                            0x1
#define _RPINR46_47_PBIO0R1_POSITION                        0x1
#define _RPINR46_47_PBIO0R1_SIZE                            0x1
#define _RPINR46_47_PBIO0R1_LENGTH                          0x1
#define _RPINR46_47_PBIO0R1_MASK                            0x2
#define _RPINR46_47_PBIO0R2_POSN                            0x2
#define _RPINR46_47_PBIO0R2_POSITION                        0x2
#define _RPINR46_47_PBIO0R2_SIZE                            0x1
#define _RPINR46_47_PBIO0R2_LENGTH                          0x1
#define _RPINR46_47_PBIO0R2_MASK                            0x4
#define _RPINR46_47_PBIO0R3_POSN                            0x3
#define _RPINR46_47_PBIO0R3_POSITION                        0x3
#define _RPINR46_47_PBIO0R3_SIZE                            0x1
#define _RPINR46_47_PBIO0R3_LENGTH                          0x1
#define _RPINR46_47_PBIO0R3_MASK                            0x8
#define _RPINR46_47_PBIO1R0_POSN                            0x4
#define _RPINR46_47_PBIO1R0_POSITION                        0x4
#define _RPINR46_47_PBIO1R0_SIZE                            0x1
#define _RPINR46_47_PBIO1R0_LENGTH                          0x1
#define _RPINR46_47_PBIO1R0_MASK                            0x10
#define _RPINR46_47_PBIO1R1_POSN                            0x5
#define _RPINR46_47_PBIO1R1_POSITION                        0x5
#define _RPINR46_47_PBIO1R1_SIZE                            0x1
#define _RPINR46_47_PBIO1R1_LENGTH                          0x1
#define _RPINR46_47_PBIO1R1_MASK                            0x20
#define _RPINR46_47_PBIO1R2_POSN                            0x6
#define _RPINR46_47_PBIO1R2_POSITION                        0x6
#define _RPINR46_47_PBIO1R2_SIZE                            0x1
#define _RPINR46_47_PBIO1R2_LENGTH                          0x1
#define _RPINR46_47_PBIO1R2_MASK                            0x40
#define _RPINR46_47_PBIO1R3_POSN                            0x7
#define _RPINR46_47_PBIO1R3_POSITION                        0x7
#define _RPINR46_47_PBIO1R3_SIZE                            0x1
#define _RPINR46_47_PBIO1R3_LENGTH                          0x1
#define _RPINR46_47_PBIO1R3_MASK                            0x80

// Register: RPINR48_49
#define RPINR48_49 RPINR48_49
extern volatile unsigned char           RPINR48_49          __at(0xE42);
#ifndef _LIB_BUILD
asm("RPINR48_49 equ 0E42h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PBIO2R                 :4;
        unsigned PBIO3R                 :4;
    };
    struct {
        unsigned PBIO2R0                :1;
        unsigned PBIO2R1                :1;
        unsigned PBIO2R2                :1;
        unsigned PBIO2R3                :1;
        unsigned PBIO3R0                :1;
        unsigned PBIO3R1                :1;
        unsigned PBIO3R2                :1;
        unsigned PBIO3R3                :1;
    };
} RPINR48_49bits_t;
extern volatile RPINR48_49bits_t RPINR48_49bits __at(0xE42);
// bitfield macros
#define _RPINR48_49_PBIO2R_POSN                             0x0
#define _RPINR48_49_PBIO2R_POSITION                         0x0
#define _RPINR48_49_PBIO2R_SIZE                             0x4
#define _RPINR48_49_PBIO2R_LENGTH                           0x4
#define _RPINR48_49_PBIO2R_MASK                             0xF
#define _RPINR48_49_PBIO3R_POSN                             0x4
#define _RPINR48_49_PBIO3R_POSITION                         0x4
#define _RPINR48_49_PBIO3R_SIZE                             0x4
#define _RPINR48_49_PBIO3R_LENGTH                           0x4
#define _RPINR48_49_PBIO3R_MASK                             0xF0
#define _RPINR48_49_PBIO2R0_POSN                            0x0
#define _RPINR48_49_PBIO2R0_POSITION                        0x0
#define _RPINR48_49_PBIO2R0_SIZE                            0x1
#define _RPINR48_49_PBIO2R0_LENGTH                          0x1
#define _RPINR48_49_PBIO2R0_MASK                            0x1
#define _RPINR48_49_PBIO2R1_POSN                            0x1
#define _RPINR48_49_PBIO2R1_POSITION                        0x1
#define _RPINR48_49_PBIO2R1_SIZE                            0x1
#define _RPINR48_49_PBIO2R1_LENGTH                          0x1
#define _RPINR48_49_PBIO2R1_MASK                            0x2
#define _RPINR48_49_PBIO2R2_POSN                            0x2
#define _RPINR48_49_PBIO2R2_POSITION                        0x2
#define _RPINR48_49_PBIO2R2_SIZE                            0x1
#define _RPINR48_49_PBIO2R2_LENGTH                          0x1
#define _RPINR48_49_PBIO2R2_MASK                            0x4
#define _RPINR48_49_PBIO2R3_POSN                            0x3
#define _RPINR48_49_PBIO2R3_POSITION                        0x3
#define _RPINR48_49_PBIO2R3_SIZE                            0x1
#define _RPINR48_49_PBIO2R3_LENGTH                          0x1
#define _RPINR48_49_PBIO2R3_MASK                            0x8
#define _RPINR48_49_PBIO3R0_POSN                            0x4
#define _RPINR48_49_PBIO3R0_POSITION                        0x4
#define _RPINR48_49_PBIO3R0_SIZE                            0x1
#define _RPINR48_49_PBIO3R0_LENGTH                          0x1
#define _RPINR48_49_PBIO3R0_MASK                            0x10
#define _RPINR48_49_PBIO3R1_POSN                            0x5
#define _RPINR48_49_PBIO3R1_POSITION                        0x5
#define _RPINR48_49_PBIO3R1_SIZE                            0x1
#define _RPINR48_49_PBIO3R1_LENGTH                          0x1
#define _RPINR48_49_PBIO3R1_MASK                            0x20
#define _RPINR48_49_PBIO3R2_POSN                            0x6
#define _RPINR48_49_PBIO3R2_POSITION                        0x6
#define _RPINR48_49_PBIO3R2_SIZE                            0x1
#define _RPINR48_49_PBIO3R2_LENGTH                          0x1
#define _RPINR48_49_PBIO3R2_MASK                            0x40
#define _RPINR48_49_PBIO3R3_POSN                            0x7
#define _RPINR48_49_PBIO3R3_POSITION                        0x7
#define _RPINR48_49_PBIO3R3_SIZE                            0x1
#define _RPINR48_49_PBIO3R3_LENGTH                          0x1
#define _RPINR48_49_PBIO3R3_MASK                            0x80

// Register: RPINR50_51
#define RPINR50_51 RPINR50_51
extern volatile unsigned char           RPINR50_51          __at(0xE43);
#ifndef _LIB_BUILD
asm("RPINR50_51 equ 0E43h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PBIO4R                 :4;
        unsigned PBIO5R                 :4;
    };
    struct {
        unsigned PBIO4R0                :1;
        unsigned PBIO4R1                :1;
        unsigned PBIO4R2                :1;
        unsigned PBIO4R3                :1;
        unsigned PBIO5R0                :1;
        unsigned PBIO5R1                :1;
        unsigned PBIO5R2                :1;
        unsigned PBIO5R3                :1;
    };
} RPINR50_51bits_t;
extern volatile RPINR50_51bits_t RPINR50_51bits __at(0xE43);
// bitfield macros
#define _RPINR50_51_PBIO4R_POSN                             0x0
#define _RPINR50_51_PBIO4R_POSITION                         0x0
#define _RPINR50_51_PBIO4R_SIZE                             0x4
#define _RPINR50_51_PBIO4R_LENGTH                           0x4
#define _RPINR50_51_PBIO4R_MASK                             0xF
#define _RPINR50_51_PBIO5R_POSN                             0x4
#define _RPINR50_51_PBIO5R_POSITION                         0x4
#define _RPINR50_51_PBIO5R_SIZE                             0x4
#define _RPINR50_51_PBIO5R_LENGTH                           0x4
#define _RPINR50_51_PBIO5R_MASK                             0xF0
#define _RPINR50_51_PBIO4R0_POSN                            0x0
#define _RPINR50_51_PBIO4R0_POSITION                        0x0
#define _RPINR50_51_PBIO4R0_SIZE                            0x1
#define _RPINR50_51_PBIO4R0_LENGTH                          0x1
#define _RPINR50_51_PBIO4R0_MASK                            0x1
#define _RPINR50_51_PBIO4R1_POSN                            0x1
#define _RPINR50_51_PBIO4R1_POSITION                        0x1
#define _RPINR50_51_PBIO4R1_SIZE                            0x1
#define _RPINR50_51_PBIO4R1_LENGTH                          0x1
#define _RPINR50_51_PBIO4R1_MASK                            0x2
#define _RPINR50_51_PBIO4R2_POSN                            0x2
#define _RPINR50_51_PBIO4R2_POSITION                        0x2
#define _RPINR50_51_PBIO4R2_SIZE                            0x1
#define _RPINR50_51_PBIO4R2_LENGTH                          0x1
#define _RPINR50_51_PBIO4R2_MASK                            0x4
#define _RPINR50_51_PBIO4R3_POSN                            0x3
#define _RPINR50_51_PBIO4R3_POSITION                        0x3
#define _RPINR50_51_PBIO4R3_SIZE                            0x1
#define _RPINR50_51_PBIO4R3_LENGTH                          0x1
#define _RPINR50_51_PBIO4R3_MASK                            0x8
#define _RPINR50_51_PBIO5R0_POSN                            0x4
#define _RPINR50_51_PBIO5R0_POSITION                        0x4
#define _RPINR50_51_PBIO5R0_SIZE                            0x1
#define _RPINR50_51_PBIO5R0_LENGTH                          0x1
#define _RPINR50_51_PBIO5R0_MASK                            0x10
#define _RPINR50_51_PBIO5R1_POSN                            0x5
#define _RPINR50_51_PBIO5R1_POSITION                        0x5
#define _RPINR50_51_PBIO5R1_SIZE                            0x1
#define _RPINR50_51_PBIO5R1_LENGTH                          0x1
#define _RPINR50_51_PBIO5R1_MASK                            0x20
#define _RPINR50_51_PBIO5R2_POSN                            0x6
#define _RPINR50_51_PBIO5R2_POSITION                        0x6
#define _RPINR50_51_PBIO5R2_SIZE                            0x1
#define _RPINR50_51_PBIO5R2_LENGTH                          0x1
#define _RPINR50_51_PBIO5R2_MASK                            0x40
#define _RPINR50_51_PBIO5R3_POSN                            0x7
#define _RPINR50_51_PBIO5R3_POSITION                        0x7
#define _RPINR50_51_PBIO5R3_SIZE                            0x1
#define _RPINR50_51_PBIO5R3_LENGTH                          0x1
#define _RPINR50_51_PBIO5R3_MASK                            0x80

