MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: ADCBUF5H
#define ADCBUF5H ADCBUF5H
extern volatile unsigned char           ADCBUF5H            __at(0xE51);
#ifndef _LIB_BUILD
asm("ADCBUF5H equ 0E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF5H               :8;
    };
} ADCBUF5Hbits_t;
extern volatile ADCBUF5Hbits_t ADCBUF5Hbits __at(0xE51);
// bitfield macros
#define _ADCBUF5H_ADCBUF5H_POSN                             0x0
#define _ADCBUF5H_ADCBUF5H_POSITION                         0x0
#define _ADCBUF5H_ADCBUF5H_SIZE                             0x8
#define _ADCBUF5H_ADCBUF5H_LENGTH                           0x8
#define _ADCBUF5H_ADCBUF5H_MASK                             0xFF

// Register: ADCBUF6
#define ADCBUF6 ADCBUF6
extern volatile unsigned short          ADCBUF6             __at(0xE52);
#ifndef _LIB_BUILD
asm("ADCBUF6 equ 0E52h");
#endif

// Register: ADCBUF6L
#define ADCBUF6L ADCBUF6L
extern volatile unsigned char           ADCBUF6L            __at(0xE52);
#ifndef _LIB_BUILD
asm("ADCBUF6L equ 0E52h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF6L               :8;
    };
} ADCBUF6Lbits_t;
extern volatile ADCBUF6Lbits_t ADCBUF6Lbits __at(0xE52);
// bitfield macros
#define _ADCBUF6L_ADCBUF6L_POSN                             0x0
#define _ADCBUF6L_ADCBUF6L_POSITION                         0x0
#define _ADCBUF6L_ADCBUF6L_SIZE                             0x8
#define _ADCBUF6L_ADCBUF6L_LENGTH                           0x8
#define _ADCBUF6L_ADCBUF6L_MASK                             0xFF

// Register: ADCBUF6H
#define ADCBUF6H ADCBUF6H
extern volatile unsigned char           ADCBUF6H            __at(0xE53);
#ifndef _LIB_BUILD
asm("ADCBUF6H equ 0E53h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF6H               :8;
    };
} ADCBUF6Hbits_t;
extern volatile ADCBUF6Hbits_t ADCBUF6Hbits __at(0xE53);
// bitfield macros
#define _ADCBUF6H_ADCBUF6H_POSN                             0x0
#define _ADCBUF6H_ADCBUF6H_POSITION                         0x0
#define _ADCBUF6H_ADCBUF6H_SIZE                             0x8
#define _ADCBUF6H_ADCBUF6H_LENGTH                           0x8
#define _ADCBUF6H_ADCBUF6H_MASK                             0xFF

// Register: ADCBUF7
#define ADCBUF7 ADCBUF7
extern volatile unsigned short          ADCBUF7             __at(0xE54);
#ifndef _LIB_BUILD
asm("ADCBUF7 equ 0E54h");
#endif

// Register: ADCBUF7L
#define ADCBUF7L ADCBUF7L
extern volatile unsigned char           ADCBUF7L            __at(0xE54);
#ifndef _LIB_BUILD
asm("ADCBUF7L equ 0E54h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF7L               :8;
    };
} ADCBUF7Lbits_t;
extern volatile ADCBUF7Lbits_t ADCBUF7Lbits __at(0xE54);
// bitfield macros
#define _ADCBUF7L_ADCBUF7L_POSN                             0x0
#define _ADCBUF7L_ADCBUF7L_POSITION                         0x0
#define _ADCBUF7L_ADCBUF7L_SIZE                             0x8
#define _ADCBUF7L_ADCBUF7L_LENGTH                           0x8
#define _ADCBUF7L_ADCBUF7L_MASK                             0xFF

// Register: ADCBUF7H
#define ADCBUF7H ADCBUF7H
extern volatile unsigned char           ADCBUF7H            __at(0xE55);
#ifndef _LIB_BUILD
asm("ADCBUF7H equ 0E55h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF7H               :8;
    };
} ADCBUF7Hbits_t;
extern volatile ADCBUF7Hbits_t ADCBUF7Hbits __at(0xE55);
// bitfield macros
#define _ADCBUF7H_ADCBUF7H_POSN                             0x0
#define _ADCBUF7H_ADCBUF7H_POSITION                         0x0
#define _ADCBUF7H_ADCBUF7H_SIZE                             0x8
#define _ADCBUF7H_ADCBUF7H_LENGTH                           0x8
#define _ADCBUF7H_ADCBUF7H_MASK                             0xFF

// Register: ADCBUF8
#define ADCBUF8 ADCBUF8
extern volatile unsigned short          ADCBUF8             __at(0xE56);
#ifndef _LIB_BUILD
asm("ADCBUF8 equ 0E56h");
#endif

// Register: ADCBUF8L
#define ADCBUF8L ADCBUF8L
extern volatile unsigned char           ADCBUF8L            __at(0xE56);
#ifndef _LIB_BUILD
asm("ADCBUF8L equ 0E56h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF8L               :8;
    };
} ADCBUF8Lbits_t;
extern volatile ADCBUF8Lbits_t ADCBUF8Lbits __at(0xE56);
// bitfield macros
#define _ADCBUF8L_ADCBUF8L_POSN                             0x0
#define _ADCBUF8L_ADCBUF8L_POSITION                         0x0
#define _ADCBUF8L_ADCBUF8L_SIZE                             0x8
#define _ADCBUF8L_ADCBUF8L_LENGTH                           0x8
#define _ADCBUF8L_ADCBUF8L_MASK                             0xFF

// Register: ADCBUF8H
#define ADCBUF8H ADCBUF8H
extern volatile unsigned char           ADCBUF8H            __at(0xE57);
#ifndef _LIB_BUILD
asm("ADCBUF8H equ 0E57h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF8H               :8;
    };
} ADCBUF8Hbits_t;
extern volatile ADCBUF8Hbits_t ADCBUF8Hbits __at(0xE57);
// bitfield macros
#define _ADCBUF8H_ADCBUF8H_POSN                             0x0
#define _ADCBUF8H_ADCBUF8H_POSITION                         0x0
#define _ADCBUF8H_ADCBUF8H_SIZE                             0x8
#define _ADCBUF8H_ADCBUF8H_LENGTH                           0x8
#define _ADCBUF8H_ADCBUF8H_MASK                             0xFF

// Register: ADCBUF9
#define ADCBUF9 ADCBUF9
extern volatile unsigned short          ADCBUF9             __at(0xE58);
#ifndef _LIB_BUILD
asm("ADCBUF9 equ 0E58h");
#endif

// Register: ADCBUF9L
#define ADCBUF9L ADCBUF9L
extern volatile unsigned char           ADCBUF9L            __at(0xE58);
#ifndef _LIB_BUILD
asm("ADCBUF9L equ 0E58h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF9L               :8;
    };
} ADCBUF9Lbits_t;
extern volatile ADCBUF9Lbits_t ADCBUF9Lbits __at(0xE58);
// bitfield macros
#define _ADCBUF9L_ADCBUF9L_POSN                             0x0
#define _ADCBUF9L_ADCBUF9L_POSITION                         0x0
#define _ADCBUF9L_ADCBUF9L_SIZE                             0x8
#define _ADCBUF9L_ADCBUF9L_LENGTH                           0x8
#define _ADCBUF9L_ADCBUF9L_MASK                             0xFF

