MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: ADCBUF9H
#define ADCBUF9H ADCBUF9H
extern volatile unsigned char           ADCBUF9H            __at(0xE59);
#ifndef _LIB_BUILD
asm("ADCBUF9H equ 0E59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF9H               :8;
    };
} ADCBUF9Hbits_t;
extern volatile ADCBUF9Hbits_t ADCBUF9Hbits __at(0xE59);
// bitfield macros
#define _ADCBUF9H_ADCBUF9H_POSN                             0x0
#define _ADCBUF9H_ADCBUF9H_POSITION                         0x0
#define _ADCBUF9H_ADCBUF9H_SIZE                             0x8
#define _ADCBUF9H_ADCBUF9H_LENGTH                           0x8
#define _ADCBUF9H_ADCBUF9H_MASK                             0xFF

// Register: ADCBUF10
#define ADCBUF10 ADCBUF10
extern volatile unsigned short          ADCBUF10            __at(0xE5A);
#ifndef _LIB_BUILD
asm("ADCBUF10 equ 0E5Ah");
#endif

// Register: ADCBUF10L
#define ADCBUF10L ADCBUF10L
extern volatile unsigned char           ADCBUF10L           __at(0xE5A);
#ifndef _LIB_BUILD
asm("ADCBUF10L equ 0E5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF10L              :8;
    };
} ADCBUF10Lbits_t;
extern volatile ADCBUF10Lbits_t ADCBUF10Lbits __at(0xE5A);
// bitfield macros
#define _ADCBUF10L_ADCBUF10L_POSN                           0x0
#define _ADCBUF10L_ADCBUF10L_POSITION                       0x0
#define _ADCBUF10L_ADCBUF10L_SIZE                           0x8
#define _ADCBUF10L_ADCBUF10L_LENGTH                         0x8
#define _ADCBUF10L_ADCBUF10L_MASK                           0xFF

// Register: ADCBUF10H
#define ADCBUF10H ADCBUF10H
extern volatile unsigned char           ADCBUF10H           __at(0xE5B);
#ifndef _LIB_BUILD
asm("ADCBUF10H equ 0E5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF10H              :8;
    };
} ADCBUF10Hbits_t;
extern volatile ADCBUF10Hbits_t ADCBUF10Hbits __at(0xE5B);
// bitfield macros
#define _ADCBUF10H_ADCBUF10H_POSN                           0x0
#define _ADCBUF10H_ADCBUF10H_POSITION                       0x0
#define _ADCBUF10H_ADCBUF10H_SIZE                           0x8
#define _ADCBUF10H_ADCBUF10H_LENGTH                         0x8
#define _ADCBUF10H_ADCBUF10H_MASK                           0xFF

// Register: ADCBUF11
#define ADCBUF11 ADCBUF11
extern volatile unsigned short          ADCBUF11            __at(0xE5C);
#ifndef _LIB_BUILD
asm("ADCBUF11 equ 0E5Ch");
#endif

// Register: ADCBUF11L
#define ADCBUF11L ADCBUF11L
extern volatile unsigned char           ADCBUF11L           __at(0xE5C);
#ifndef _LIB_BUILD
asm("ADCBUF11L equ 0E5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF11L              :8;
    };
} ADCBUF11Lbits_t;
extern volatile ADCBUF11Lbits_t ADCBUF11Lbits __at(0xE5C);
// bitfield macros
#define _ADCBUF11L_ADCBUF11L_POSN                           0x0
#define _ADCBUF11L_ADCBUF11L_POSITION                       0x0
#define _ADCBUF11L_ADCBUF11L_SIZE                           0x8
#define _ADCBUF11L_ADCBUF11L_LENGTH                         0x8
#define _ADCBUF11L_ADCBUF11L_MASK                           0xFF

// Register: ADCBUF11H
#define ADCBUF11H ADCBUF11H
extern volatile unsigned char           ADCBUF11H           __at(0xE5D);
#ifndef _LIB_BUILD
asm("ADCBUF11H equ 0E5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF11H              :8;
    };
} ADCBUF11Hbits_t;
extern volatile ADCBUF11Hbits_t ADCBUF11Hbits __at(0xE5D);
// bitfield macros
#define _ADCBUF11H_ADCBUF11H_POSN                           0x0
#define _ADCBUF11H_ADCBUF11H_POSITION                       0x0
#define _ADCBUF11H_ADCBUF11H_SIZE                           0x8
#define _ADCBUF11H_ADCBUF11H_LENGTH                         0x8
#define _ADCBUF11H_ADCBUF11H_MASK                           0xFF

// Register: ADCBUF12
#define ADCBUF12 ADCBUF12
extern volatile unsigned short          ADCBUF12            __at(0xE5E);
#ifndef _LIB_BUILD
asm("ADCBUF12 equ 0E5Eh");
#endif

// Register: ADCBUF12L
#define ADCBUF12L ADCBUF12L
extern volatile unsigned char           ADCBUF12L           __at(0xE5E);
#ifndef _LIB_BUILD
asm("ADCBUF12L equ 0E5Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF12L              :8;
    };
} ADCBUF12Lbits_t;
extern volatile ADCBUF12Lbits_t ADCBUF12Lbits __at(0xE5E);
// bitfield macros
#define _ADCBUF12L_ADCBUF12L_POSN                           0x0
#define _ADCBUF12L_ADCBUF12L_POSITION                       0x0
#define _ADCBUF12L_ADCBUF12L_SIZE                           0x8
#define _ADCBUF12L_ADCBUF12L_LENGTH                         0x8
#define _ADCBUF12L_ADCBUF12L_MASK                           0xFF

// Register: ADCBUF12H
#define ADCBUF12H ADCBUF12H
extern volatile unsigned char           ADCBUF12H           __at(0xE5F);
#ifndef _LIB_BUILD
asm("ADCBUF12H equ 0E5Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF12H              :8;
    };
} ADCBUF12Hbits_t;
extern volatile ADCBUF12Hbits_t ADCBUF12Hbits __at(0xE5F);
// bitfield macros
#define _ADCBUF12H_ADCBUF12H_POSN                           0x0
#define _ADCBUF12H_ADCBUF12H_POSITION                       0x0
#define _ADCBUF12H_ADCBUF12H_SIZE                           0x8
#define _ADCBUF12H_ADCBUF12H_LENGTH                         0x8
#define _ADCBUF12H_ADCBUF12H_MASK                           0xFF

// Register: ADCBUF13
#define ADCBUF13 ADCBUF13
extern volatile unsigned short          ADCBUF13            __at(0xE60);
#ifndef _LIB_BUILD
asm("ADCBUF13 equ 0E60h");
#endif

// Register: ADCBUF13L
#define ADCBUF13L ADCBUF13L
extern volatile unsigned char           ADCBUF13L           __at(0xE60);
#ifndef _LIB_BUILD
asm("ADCBUF13L equ 0E60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCBUF13L              :8;
    };
} ADCBUF13Lbits_t;
extern volatile ADCBUF13Lbits_t ADCBUF13Lbits __at(0xE60);
// bitfield macros
#define _ADCBUF13L_ADCBUF13L_POSN                           0x0
#define _ADCBUF13L_ADCBUF13L_POSITION                       0x0
#define _ADCBUF13L_ADCBUF13L_SIZE                           0x8
#define _ADCBUF13L_ADCBUF13L_LENGTH                         0x8
#define _ADCBUF13L_ADCBUF13L_MASK                           0xFF

