MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
extern volatile ADCTMUEN1Lbits_t ADCTMUEN1Lbits __at(0xE7C);
// bitfield macros
#define _ADCTMUEN1L_CTMUEN_POSN                             0x0
#define _ADCTMUEN1L_CTMUEN_POSITION                         0x0
#define _ADCTMUEN1L_CTMUEN_SIZE                             0x8
#define _ADCTMUEN1L_CTMUEN_LENGTH                           0x8
#define _ADCTMUEN1L_CTMUEN_MASK                             0xFF
#define _ADCTMUEN1L_CTUMEN16_POSN                           0x0
#define _ADCTMUEN1L_CTUMEN16_POSITION                       0x0
#define _ADCTMUEN1L_CTUMEN16_SIZE                           0x1
#define _ADCTMUEN1L_CTUMEN16_LENGTH                         0x1
#define _ADCTMUEN1L_CTUMEN16_MASK                           0x1
#define _ADCTMUEN1L_CTUMEN17_POSN                           0x1
#define _ADCTMUEN1L_CTUMEN17_POSITION                       0x1
#define _ADCTMUEN1L_CTUMEN17_SIZE                           0x1
#define _ADCTMUEN1L_CTUMEN17_LENGTH                         0x1
#define _ADCTMUEN1L_CTUMEN17_MASK                           0x2
#define _ADCTMUEN1L_CTUMEN18_POSN                           0x2
#define _ADCTMUEN1L_CTUMEN18_POSITION                       0x2
#define _ADCTMUEN1L_CTUMEN18_SIZE                           0x1
#define _ADCTMUEN1L_CTUMEN18_LENGTH                         0x1
#define _ADCTMUEN1L_CTUMEN18_MASK                           0x4
#define _ADCTMUEN1L_CTUMEN19_POSN                           0x3
#define _ADCTMUEN1L_CTUMEN19_POSITION                       0x3
#define _ADCTMUEN1L_CTUMEN19_SIZE                           0x1
#define _ADCTMUEN1L_CTUMEN19_LENGTH                         0x1
#define _ADCTMUEN1L_CTUMEN19_MASK                           0x8
#define _ADCTMUEN1L_CTMUEN20_POSN                           0x4
#define _ADCTMUEN1L_CTMUEN20_POSITION                       0x4
#define _ADCTMUEN1L_CTMUEN20_SIZE                           0x1
#define _ADCTMUEN1L_CTMUEN20_LENGTH                         0x1
#define _ADCTMUEN1L_CTMUEN20_MASK                           0x10
#define _ADCTMUEN1L_CTMUEN21_POSN                           0x5
#define _ADCTMUEN1L_CTMUEN21_POSITION                       0x5
#define _ADCTMUEN1L_CTMUEN21_SIZE                           0x1
#define _ADCTMUEN1L_CTMUEN21_LENGTH                         0x1
#define _ADCTMUEN1L_CTMUEN21_MASK                           0x20
#define _ADCTMUEN1L_CTMUEN22_POSN                           0x6
#define _ADCTMUEN1L_CTMUEN22_POSITION                       0x6
#define _ADCTMUEN1L_CTMUEN22_SIZE                           0x1
#define _ADCTMUEN1L_CTMUEN22_LENGTH                         0x1
#define _ADCTMUEN1L_CTMUEN22_MASK                           0x40
#define _ADCTMUEN1L_CTMUEN23_POSN                           0x7
#define _ADCTMUEN1L_CTMUEN23_POSITION                       0x7
#define _ADCTMUEN1L_CTMUEN23_SIZE                           0x1
#define _ADCTMUEN1L_CTMUEN23_LENGTH                         0x1
#define _ADCTMUEN1L_CTMUEN23_MASK                           0x80

// Register: ADCTMUEN1H
#define ADCTMUEN1H ADCTMUEN1H
extern volatile unsigned char           ADCTMUEN1H          __at(0xE7D);
#ifndef _LIB_BUILD
asm("ADCTMUEN1H equ 0E7Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTMUEN                 :8;
    };
    struct {
        unsigned CTUMEN24               :1;
        unsigned CTUMEN25               :1;
        unsigned CTUMEN26               :1;
        unsigned CTUMEN27               :1;
        unsigned CTUMEN28               :1;
        unsigned CTUMEN29               :1;
        unsigned CTMUEN30               :1;
    };
} ADCTMUEN1Hbits_t;
extern volatile ADCTMUEN1Hbits_t ADCTMUEN1Hbits __at(0xE7D);
// bitfield macros
#define _ADCTMUEN1H_CTMUEN_POSN                             0x0
#define _ADCTMUEN1H_CTMUEN_POSITION                         0x0
#define _ADCTMUEN1H_CTMUEN_SIZE                             0x8
#define _ADCTMUEN1H_CTMUEN_LENGTH                           0x8
#define _ADCTMUEN1H_CTMUEN_MASK                             0xFF
#define _ADCTMUEN1H_CTUMEN24_POSN                           0x0
#define _ADCTMUEN1H_CTUMEN24_POSITION                       0x0
#define _ADCTMUEN1H_CTUMEN24_SIZE                           0x1
#define _ADCTMUEN1H_CTUMEN24_LENGTH                         0x1
#define _ADCTMUEN1H_CTUMEN24_MASK                           0x1
#define _ADCTMUEN1H_CTUMEN25_POSN                           0x1
#define _ADCTMUEN1H_CTUMEN25_POSITION                       0x1
#define _ADCTMUEN1H_CTUMEN25_SIZE                           0x1
#define _ADCTMUEN1H_CTUMEN25_LENGTH                         0x1
#define _ADCTMUEN1H_CTUMEN25_MASK                           0x2
#define _ADCTMUEN1H_CTUMEN26_POSN                           0x2
#define _ADCTMUEN1H_CTUMEN26_POSITION                       0x2
#define _ADCTMUEN1H_CTUMEN26_SIZE                           0x1
#define _ADCTMUEN1H_CTUMEN26_LENGTH                         0x1
#define _ADCTMUEN1H_CTUMEN26_MASK                           0x4
#define _ADCTMUEN1H_CTUMEN27_POSN                           0x3
#define _ADCTMUEN1H_CTUMEN27_POSITION                       0x3
#define _ADCTMUEN1H_CTUMEN27_SIZE                           0x1
#define _ADCTMUEN1H_CTUMEN27_LENGTH                         0x1
#define _ADCTMUEN1H_CTUMEN27_MASK                           0x8
#define _ADCTMUEN1H_CTUMEN28_POSN                           0x4
#define _ADCTMUEN1H_CTUMEN28_POSITION                       0x4
#define _ADCTMUEN1H_CTUMEN28_SIZE                           0x1
#define _ADCTMUEN1H_CTUMEN28_LENGTH                         0x1
#define _ADCTMUEN1H_CTUMEN28_MASK                           0x10
#define _ADCTMUEN1H_CTUMEN29_POSN                           0x5
#define _ADCTMUEN1H_CTUMEN29_POSITION                       0x5
#define _ADCTMUEN1H_CTUMEN29_SIZE                           0x1
#define _ADCTMUEN1H_CTUMEN29_LENGTH                         0x1
#define _ADCTMUEN1H_CTUMEN29_MASK                           0x20
#define _ADCTMUEN1H_CTMUEN30_POSN                           0x6
#define _ADCTMUEN1H_CTMUEN30_POSITION                       0x6
#define _ADCTMUEN1H_CTMUEN30_SIZE                           0x1
#define _ADCTMUEN1H_CTMUEN30_LENGTH                         0x1
#define _ADCTMUEN1H_CTMUEN30_MASK                           0x40

