MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
extern volatile unsigned char           LCDDATA20           __at(0xEA2);
#ifndef _LIB_BUILD
asm("LCDDATA20 equ 0EA2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C2                  :1;
        unsigned S33C2                  :1;
        unsigned S34C2                  :1;
        unsigned S35C2                  :1;
        unsigned S36C2                  :1;
        unsigned S37C2                  :1;
        unsigned S38C2                  :1;
        unsigned S39C2                  :1;
    };
} LCDDATA20bits_t;
extern volatile LCDDATA20bits_t LCDDATA20bits __at(0xEA2);
// bitfield macros
#define _LCDDATA20_S32C2_POSN                               0x0
#define _LCDDATA20_S32C2_POSITION                           0x0
#define _LCDDATA20_S32C2_SIZE                               0x1
#define _LCDDATA20_S32C2_LENGTH                             0x1
#define _LCDDATA20_S32C2_MASK                               0x1
#define _LCDDATA20_S33C2_POSN                               0x1
#define _LCDDATA20_S33C2_POSITION                           0x1
#define _LCDDATA20_S33C2_SIZE                               0x1
#define _LCDDATA20_S33C2_LENGTH                             0x1
#define _LCDDATA20_S33C2_MASK                               0x2
#define _LCDDATA20_S34C2_POSN                               0x2
#define _LCDDATA20_S34C2_POSITION                           0x2
#define _LCDDATA20_S34C2_SIZE                               0x1
#define _LCDDATA20_S34C2_LENGTH                             0x1
#define _LCDDATA20_S34C2_MASK                               0x4
#define _LCDDATA20_S35C2_POSN                               0x3
#define _LCDDATA20_S35C2_POSITION                           0x3
#define _LCDDATA20_S35C2_SIZE                               0x1
#define _LCDDATA20_S35C2_LENGTH                             0x1
#define _LCDDATA20_S35C2_MASK                               0x8
#define _LCDDATA20_S36C2_POSN                               0x4
#define _LCDDATA20_S36C2_POSITION                           0x4
#define _LCDDATA20_S36C2_SIZE                               0x1
#define _LCDDATA20_S36C2_LENGTH                             0x1
#define _LCDDATA20_S36C2_MASK                               0x10
#define _LCDDATA20_S37C2_POSN                               0x5
#define _LCDDATA20_S37C2_POSITION                           0x5
#define _LCDDATA20_S37C2_SIZE                               0x1
#define _LCDDATA20_S37C2_LENGTH                             0x1
#define _LCDDATA20_S37C2_MASK                               0x20
#define _LCDDATA20_S38C2_POSN                               0x6
#define _LCDDATA20_S38C2_POSITION                           0x6
#define _LCDDATA20_S38C2_SIZE                               0x1
#define _LCDDATA20_S38C2_LENGTH                             0x1
#define _LCDDATA20_S38C2_MASK                               0x40
#define _LCDDATA20_S39C2_POSN                               0x7
#define _LCDDATA20_S39C2_POSITION                           0x7
#define _LCDDATA20_S39C2_SIZE                               0x1
#define _LCDDATA20_S39C2_LENGTH                             0x1
#define _LCDDATA20_S39C2_MASK                               0x80

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
extern volatile unsigned char           LCDDATA21           __at(0xEA3);
#ifndef _LIB_BUILD
asm("LCDDATA21 equ 0EA3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C2                  :1;
        unsigned S41C2                  :1;
        unsigned S42C2                  :1;
        unsigned S43C2                  :1;
        unsigned S44C2                  :1;
        unsigned S45C2                  :1;
        unsigned S46C2                  :1;
        unsigned S47C2                  :1;
    };
} LCDDATA21bits_t;
extern volatile LCDDATA21bits_t LCDDATA21bits __at(0xEA3);
// bitfield macros
#define _LCDDATA21_S40C2_POSN                               0x0
#define _LCDDATA21_S40C2_POSITION                           0x0
#define _LCDDATA21_S40C2_SIZE                               0x1
#define _LCDDATA21_S40C2_LENGTH                             0x1
#define _LCDDATA21_S40C2_MASK                               0x1
#define _LCDDATA21_S41C2_POSN                               0x1
#define _LCDDATA21_S41C2_POSITION                           0x1
#define _LCDDATA21_S41C2_SIZE                               0x1
#define _LCDDATA21_S41C2_LENGTH                             0x1
#define _LCDDATA21_S41C2_MASK                               0x2
#define _LCDDATA21_S42C2_POSN                               0x2
#define _LCDDATA21_S42C2_POSITION                           0x2
#define _LCDDATA21_S42C2_SIZE                               0x1
#define _LCDDATA21_S42C2_LENGTH                             0x1
#define _LCDDATA21_S42C2_MASK                               0x4
#define _LCDDATA21_S43C2_POSN                               0x3
#define _LCDDATA21_S43C2_POSITION                           0x3
#define _LCDDATA21_S43C2_SIZE                               0x1
#define _LCDDATA21_S43C2_LENGTH                             0x1
#define _LCDDATA21_S43C2_MASK                               0x8
#define _LCDDATA21_S44C2_POSN                               0x4
#define _LCDDATA21_S44C2_POSITION                           0x4
#define _LCDDATA21_S44C2_SIZE                               0x1
#define _LCDDATA21_S44C2_LENGTH                             0x1
#define _LCDDATA21_S44C2_MASK                               0x10
#define _LCDDATA21_S45C2_POSN                               0x5
#define _LCDDATA21_S45C2_POSITION                           0x5
#define _LCDDATA21_S45C2_SIZE                               0x1
#define _LCDDATA21_S45C2_LENGTH                             0x1
#define _LCDDATA21_S45C2_MASK                               0x20
#define _LCDDATA21_S46C2_POSN                               0x6
#define _LCDDATA21_S46C2_POSITION                           0x6
#define _LCDDATA21_S46C2_SIZE                               0x1
#define _LCDDATA21_S46C2_LENGTH                             0x1
#define _LCDDATA21_S46C2_MASK                               0x40
#define _LCDDATA21_S47C2_POSN                               0x7
#define _LCDDATA21_S47C2_POSITION                           0x7
#define _LCDDATA21_S47C2_SIZE                               0x1
#define _LCDDATA21_S47C2_LENGTH                             0x1
#define _LCDDATA21_S47C2_MASK                               0x80

