MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
extern volatile LCDDATA24bits_t LCDDATA24bits __at(0xEA6);
// bitfield macros
#define _LCDDATA24_S00C3_POSN                               0x0
#define _LCDDATA24_S00C3_POSITION                           0x0
#define _LCDDATA24_S00C3_SIZE                               0x1
#define _LCDDATA24_S00C3_LENGTH                             0x1
#define _LCDDATA24_S00C3_MASK                               0x1
#define _LCDDATA24_S01C3_POSN                               0x1
#define _LCDDATA24_S01C3_POSITION                           0x1
#define _LCDDATA24_S01C3_SIZE                               0x1
#define _LCDDATA24_S01C3_LENGTH                             0x1
#define _LCDDATA24_S01C3_MASK                               0x2
#define _LCDDATA24_S02C3_POSN                               0x2
#define _LCDDATA24_S02C3_POSITION                           0x2
#define _LCDDATA24_S02C3_SIZE                               0x1
#define _LCDDATA24_S02C3_LENGTH                             0x1
#define _LCDDATA24_S02C3_MASK                               0x4
#define _LCDDATA24_S03C3_POSN                               0x3
#define _LCDDATA24_S03C3_POSITION                           0x3
#define _LCDDATA24_S03C3_SIZE                               0x1
#define _LCDDATA24_S03C3_LENGTH                             0x1
#define _LCDDATA24_S03C3_MASK                               0x8
#define _LCDDATA24_S04C3_POSN                               0x4
#define _LCDDATA24_S04C3_POSITION                           0x4
#define _LCDDATA24_S04C3_SIZE                               0x1
#define _LCDDATA24_S04C3_LENGTH                             0x1
#define _LCDDATA24_S04C3_MASK                               0x10
#define _LCDDATA24_S05C3_POSN                               0x5
#define _LCDDATA24_S05C3_POSITION                           0x5
#define _LCDDATA24_S05C3_SIZE                               0x1
#define _LCDDATA24_S05C3_LENGTH                             0x1
#define _LCDDATA24_S05C3_MASK                               0x20
#define _LCDDATA24_S06C3_POSN                               0x6
#define _LCDDATA24_S06C3_POSITION                           0x6
#define _LCDDATA24_S06C3_SIZE                               0x1
#define _LCDDATA24_S06C3_LENGTH                             0x1
#define _LCDDATA24_S06C3_MASK                               0x40
#define _LCDDATA24_S07C3_POSN                               0x7
#define _LCDDATA24_S07C3_POSITION                           0x7
#define _LCDDATA24_S07C3_SIZE                               0x1
#define _LCDDATA24_S07C3_LENGTH                             0x1
#define _LCDDATA24_S07C3_MASK                               0x80

// Register: LCDDATA25
#define LCDDATA25 LCDDATA25
extern volatile unsigned char           LCDDATA25           __at(0xEA7);
#ifndef _LIB_BUILD
asm("LCDDATA25 equ 0EA7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C3                  :1;
        unsigned S09C3                  :1;
        unsigned S10C3                  :1;
        unsigned S11C3                  :1;
        unsigned S12C3                  :1;
        unsigned S13C3                  :1;
        unsigned S14C3                  :1;
        unsigned S15C3                  :1;
    };
} LCDDATA25bits_t;
extern volatile LCDDATA25bits_t LCDDATA25bits __at(0xEA7);
// bitfield macros
#define _LCDDATA25_S08C3_POSN                               0x0
#define _LCDDATA25_S08C3_POSITION                           0x0
#define _LCDDATA25_S08C3_SIZE                               0x1
#define _LCDDATA25_S08C3_LENGTH                             0x1
#define _LCDDATA25_S08C3_MASK                               0x1
#define _LCDDATA25_S09C3_POSN                               0x1
#define _LCDDATA25_S09C3_POSITION                           0x1
#define _LCDDATA25_S09C3_SIZE                               0x1
#define _LCDDATA25_S09C3_LENGTH                             0x1
#define _LCDDATA25_S09C3_MASK                               0x2
#define _LCDDATA25_S10C3_POSN                               0x2
#define _LCDDATA25_S10C3_POSITION                           0x2
#define _LCDDATA25_S10C3_SIZE                               0x1
#define _LCDDATA25_S10C3_LENGTH                             0x1
#define _LCDDATA25_S10C3_MASK                               0x4
#define _LCDDATA25_S11C3_POSN                               0x3
#define _LCDDATA25_S11C3_POSITION                           0x3
#define _LCDDATA25_S11C3_SIZE                               0x1
#define _LCDDATA25_S11C3_LENGTH                             0x1
#define _LCDDATA25_S11C3_MASK                               0x8
#define _LCDDATA25_S12C3_POSN                               0x4
#define _LCDDATA25_S12C3_POSITION                           0x4
#define _LCDDATA25_S12C3_SIZE                               0x1
#define _LCDDATA25_S12C3_LENGTH                             0x1
#define _LCDDATA25_S12C3_MASK                               0x10
#define _LCDDATA25_S13C3_POSN                               0x5
#define _LCDDATA25_S13C3_POSITION                           0x5
#define _LCDDATA25_S13C3_SIZE                               0x1
#define _LCDDATA25_S13C3_LENGTH                             0x1
#define _LCDDATA25_S13C3_MASK                               0x20
#define _LCDDATA25_S14C3_POSN                               0x6
#define _LCDDATA25_S14C3_POSITION                           0x6
#define _LCDDATA25_S14C3_SIZE                               0x1
#define _LCDDATA25_S14C3_LENGTH                             0x1
#define _LCDDATA25_S14C3_MASK                               0x40
#define _LCDDATA25_S15C3_POSN                               0x7
#define _LCDDATA25_S15C3_POSITION                           0x7
#define _LCDDATA25_S15C3_SIZE                               0x1
#define _LCDDATA25_S15C3_LENGTH                             0x1
#define _LCDDATA25_S15C3_MASK                               0x80

// Register: LCDDATA26
#define LCDDATA26 LCDDATA26
extern volatile unsigned char           LCDDATA26           __at(0xEA8);
#ifndef _LIB_BUILD
asm("LCDDATA26 equ 0EA8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C3                  :1;
        unsigned S17C3                  :1;
        unsigned S18C3                  :1;
        unsigned S19C3                  :1;
        unsigned S20C3                  :1;
        unsigned S21C3                  :1;
        unsigned S22C3                  :1;
        unsigned S23C3                  :1;
    };
} LCDDATA26bits_t;
extern volatile LCDDATA26bits_t LCDDATA26bits __at(0xEA8);
// bitfield macros
#define _LCDDATA26_S16C3_POSN                               0x0
#define _LCDDATA26_S16C3_POSITION                           0x0
#define _LCDDATA26_S16C3_SIZE                               0x1
#define _LCDDATA26_S16C3_LENGTH                             0x1
#define _LCDDATA26_S16C3_MASK                               0x1
#define _LCDDATA26_S17C3_POSN                               0x1
#define _LCDDATA26_S17C3_POSITION                           0x1
#define _LCDDATA26_S17C3_SIZE                               0x1
#define _LCDDATA26_S17C3_LENGTH                             0x1
#define _LCDDATA26_S17C3_MASK                               0x2
#define _LCDDATA26_S18C3_POSN                               0x2
#define _LCDDATA26_S18C3_POSITION                           0x2
#define _LCDDATA26_S18C3_SIZE                               0x1
#define _LCDDATA26_S18C3_LENGTH                             0x1
#define _LCDDATA26_S18C3_MASK                               0x4
#define _LCDDATA26_S19C3_POSN                               0x3
#define _LCDDATA26_S19C3_POSITION                           0x3
#define _LCDDATA26_S19C3_SIZE                               0x1
#define _LCDDATA26_S19C3_LENGTH                             0x1
#define _LCDDATA26_S19C3_MASK                               0x8
#define _LCDDATA26_S20C3_POSN                               0x4
#define _LCDDATA26_S20C3_POSITION                           0x4
#define _LCDDATA26_S20C3_SIZE                               0x1
#define _LCDDATA26_S20C3_LENGTH                             0x1
#define _LCDDATA26_S20C3_MASK                               0x10
#define _LCDDATA26_S21C3_POSN                               0x5
#define _LCDDATA26_S21C3_POSITION                           0x5
#define _LCDDATA26_S21C3_SIZE                               0x1
#define _LCDDATA26_S21C3_LENGTH                             0x1
#define _LCDDATA26_S21C3_MASK                               0x20
#define _LCDDATA26_S22C3_POSN                               0x6
#define _LCDDATA26_S22C3_POSITION                           0x6
#define _LCDDATA26_S22C3_SIZE                               0x1
#define _LCDDATA26_S22C3_LENGTH                             0x1
#define _LCDDATA26_S22C3_MASK                               0x40
#define _LCDDATA26_S23C3_POSN                               0x7
#define _LCDDATA26_S23C3_POSITION                           0x7
#define _LCDDATA26_S23C3_SIZE                               0x1
#define _LCDDATA26_S23C3_LENGTH                             0x1
#define _LCDDATA26_S23C3_MASK                               0x80

// Register: LCDDATA27
#define LCDDATA27 LCDDATA27
extern volatile unsigned char           LCDDATA27           __at(0xEA9);
#ifndef _LIB_BUILD
asm("LCDDATA27 equ 0EA9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C3                  :1;
        unsigned S25C3                  :1;
        unsigned S26C3                  :1;
        unsigned S27C3                  :1;
        unsigned S28C3                  :1;
        unsigned S29C3                  :1;
        unsigned S30C3                  :1;
        unsigned S31C3                  :1;
    };
} LCDDATA27bits_t;
extern volatile LCDDATA27bits_t LCDDATA27bits __at(0xEA9);
// bitfield macros
#define _LCDDATA27_S24C3_POSN                               0x0
#define _LCDDATA27_S24C3_POSITION                           0x0
#define _LCDDATA27_S24C3_SIZE                               0x1
#define _LCDDATA27_S24C3_LENGTH                             0x1
#define _LCDDATA27_S24C3_MASK                               0x1
#define _LCDDATA27_S25C3_POSN                               0x1
#define _LCDDATA27_S25C3_POSITION                           0x1
#define _LCDDATA27_S25C3_SIZE                               0x1
#define _LCDDATA27_S25C3_LENGTH                             0x1
#define _LCDDATA27_S25C3_MASK                               0x2
#define _LCDDATA27_S26C3_POSN                               0x2
#define _LCDDATA27_S26C3_POSITION                           0x2
#define _LCDDATA27_S26C3_SIZE                               0x1
#define _LCDDATA27_S26C3_LENGTH                             0x1
#define _LCDDATA27_S26C3_MASK                               0x4
#define _LCDDATA27_S27C3_POSN                               0x3
#define _LCDDATA27_S27C3_POSITION                           0x3
#define _LCDDATA27_S27C3_SIZE                               0x1
#define _LCDDATA27_S27C3_LENGTH                             0x1
#define _LCDDATA27_S27C3_MASK                               0x8
#define _LCDDATA27_S28C3_POSN                               0x4
#define _LCDDATA27_S28C3_POSITION                           0x4
#define _LCDDATA27_S28C3_SIZE                               0x1
#define _LCDDATA27_S28C3_LENGTH                             0x1
#define _LCDDATA27_S28C3_MASK                               0x10
#define _LCDDATA27_S29C3_POSN                               0x5
#define _LCDDATA27_S29C3_POSITION                           0x5
#define _LCDDATA27_S29C3_SIZE                               0x1
#define _LCDDATA27_S29C3_LENGTH                             0x1
#define _LCDDATA27_S29C3_MASK                               0x20
#define _LCDDATA27_S30C3_POSN                               0x6
#define _LCDDATA27_S30C3_POSITION                           0x6
#define _LCDDATA27_S30C3_SIZE                               0x1
#define _LCDDATA27_S30C3_LENGTH                             0x1
#define _LCDDATA27_S30C3_MASK                               0x40
#define _LCDDATA27_S31C3_POSN                               0x7
#define _LCDDATA27_S31C3_POSITION                           0x7
#define _LCDDATA27_S31C3_SIZE                               0x1
#define _LCDDATA27_S31C3_LENGTH                             0x1
#define _LCDDATA27_S31C3_MASK                               0x80

// Register: LCDDATA28
#define LCDDATA28 LCDDATA28
extern volatile unsigned char           LCDDATA28           __at(0xEAA);
#ifndef _LIB_BUILD
asm("LCDDATA28 equ 0EAAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C3                  :1;
        unsigned S33C3                  :1;
        unsigned S34C3                  :1;
        unsigned S35C3                  :1;
        unsigned S36C3                  :1;
        unsigned S37C3                  :1;
        unsigned S38C3                  :1;
        unsigned S39C3                  :1;
    };
} LCDDATA28bits_t;
extern volatile LCDDATA28bits_t LCDDATA28bits __at(0xEAA);
// bitfield macros
#define _LCDDATA28_S32C3_POSN                               0x0
#define _LCDDATA28_S32C3_POSITION                           0x0
#define _LCDDATA28_S32C3_SIZE                               0x1
#define _LCDDATA28_S32C3_LENGTH                             0x1
#define _LCDDATA28_S32C3_MASK                               0x1
#define _LCDDATA28_S33C3_POSN                               0x1
#define _LCDDATA28_S33C3_POSITION                           0x1
#define _LCDDATA28_S33C3_SIZE                               0x1
#define _LCDDATA28_S33C3_LENGTH                             0x1
#define _LCDDATA28_S33C3_MASK                               0x2
#define _LCDDATA28_S34C3_POSN                               0x2
#define _LCDDATA28_S34C3_POSITION                           0x2
#define _LCDDATA28_S34C3_SIZE                               0x1
#define _LCDDATA28_S34C3_LENGTH                             0x1
#define _LCDDATA28_S34C3_MASK                               0x4
#define _LCDDATA28_S35C3_POSN                               0x3
#define _LCDDATA28_S35C3_POSITION                           0x3
#define _LCDDATA28_S35C3_SIZE                               0x1
#define _LCDDATA28_S35C3_LENGTH                             0x1
#define _LCDDATA28_S35C3_MASK                               0x8
#define _LCDDATA28_S36C3_POSN                               0x4
#define _LCDDATA28_S36C3_POSITION                           0x4
#define _LCDDATA28_S36C3_SIZE                               0x1
#define _LCDDATA28_S36C3_LENGTH                             0x1
#define _LCDDATA28_S36C3_MASK                               0x10
#define _LCDDATA28_S37C3_POSN                               0x5
#define _LCDDATA28_S37C3_POSITION                           0x5
#define _LCDDATA28_S37C3_SIZE                               0x1
#define _LCDDATA28_S37C3_LENGTH                             0x1
#define _LCDDATA28_S37C3_MASK                               0x20
#define _LCDDATA28_S38C3_POSN                               0x6
#define _LCDDATA28_S38C3_POSITION                           0x6
#define _LCDDATA28_S38C3_SIZE                               0x1
#define _LCDDATA28_S38C3_LENGTH                             0x1
#define _LCDDATA28_S38C3_MASK                               0x40
#define _LCDDATA28_S39C3_POSN                               0x7
#define _LCDDATA28_S39C3_POSITION                           0x7
#define _LCDDATA28_S39C3_SIZE                               0x1
#define _LCDDATA28_S39C3_LENGTH                             0x1
#define _LCDDATA28_S39C3_MASK                               0x80

