MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
extern volatile LCDDATA32bits_t LCDDATA32bits __at(0xEAE);
// bitfield macros
#define _LCDDATA32_S00C4_POSN                               0x0
#define _LCDDATA32_S00C4_POSITION                           0x0
#define _LCDDATA32_S00C4_SIZE                               0x1
#define _LCDDATA32_S00C4_LENGTH                             0x1
#define _LCDDATA32_S00C4_MASK                               0x1
#define _LCDDATA32_S01C4_POSN                               0x1
#define _LCDDATA32_S01C4_POSITION                           0x1
#define _LCDDATA32_S01C4_SIZE                               0x1
#define _LCDDATA32_S01C4_LENGTH                             0x1
#define _LCDDATA32_S01C4_MASK                               0x2
#define _LCDDATA32_S02C4_POSN                               0x2
#define _LCDDATA32_S02C4_POSITION                           0x2
#define _LCDDATA32_S02C4_SIZE                               0x1
#define _LCDDATA32_S02C4_LENGTH                             0x1
#define _LCDDATA32_S02C4_MASK                               0x4
#define _LCDDATA32_S03C4_POSN                               0x3
#define _LCDDATA32_S03C4_POSITION                           0x3
#define _LCDDATA32_S03C4_SIZE                               0x1
#define _LCDDATA32_S03C4_LENGTH                             0x1
#define _LCDDATA32_S03C4_MASK                               0x8
#define _LCDDATA32_S04C4_POSN                               0x4
#define _LCDDATA32_S04C4_POSITION                           0x4
#define _LCDDATA32_S04C4_SIZE                               0x1
#define _LCDDATA32_S04C4_LENGTH                             0x1
#define _LCDDATA32_S04C4_MASK                               0x10
#define _LCDDATA32_S05C4_POSN                               0x5
#define _LCDDATA32_S05C4_POSITION                           0x5
#define _LCDDATA32_S05C4_SIZE                               0x1
#define _LCDDATA32_S05C4_LENGTH                             0x1
#define _LCDDATA32_S05C4_MASK                               0x20
#define _LCDDATA32_S06C4_POSN                               0x6
#define _LCDDATA32_S06C4_POSITION                           0x6
#define _LCDDATA32_S06C4_SIZE                               0x1
#define _LCDDATA32_S06C4_LENGTH                             0x1
#define _LCDDATA32_S06C4_MASK                               0x40
#define _LCDDATA32_S07C4_POSN                               0x7
#define _LCDDATA32_S07C4_POSITION                           0x7
#define _LCDDATA32_S07C4_SIZE                               0x1
#define _LCDDATA32_S07C4_LENGTH                             0x1
#define _LCDDATA32_S07C4_MASK                               0x80

// Register: LCDDATA33
#define LCDDATA33 LCDDATA33
extern volatile unsigned char           LCDDATA33           __at(0xEAF);
#ifndef _LIB_BUILD
asm("LCDDATA33 equ 0EAFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S08C4                  :1;
        unsigned S09C4                  :1;
        unsigned S10C4                  :1;
        unsigned S11C4                  :1;
        unsigned S12C4                  :1;
        unsigned S13C4                  :1;
        unsigned S14C4                  :1;
        unsigned S15C4                  :1;
    };
} LCDDATA33bits_t;
extern volatile LCDDATA33bits_t LCDDATA33bits __at(0xEAF);
// bitfield macros
#define _LCDDATA33_S08C4_POSN                               0x0
#define _LCDDATA33_S08C4_POSITION                           0x0
#define _LCDDATA33_S08C4_SIZE                               0x1
#define _LCDDATA33_S08C4_LENGTH                             0x1
#define _LCDDATA33_S08C4_MASK                               0x1
#define _LCDDATA33_S09C4_POSN                               0x1
#define _LCDDATA33_S09C4_POSITION                           0x1
#define _LCDDATA33_S09C4_SIZE                               0x1
#define _LCDDATA33_S09C4_LENGTH                             0x1
#define _LCDDATA33_S09C4_MASK                               0x2
#define _LCDDATA33_S10C4_POSN                               0x2
#define _LCDDATA33_S10C4_POSITION                           0x2
#define _LCDDATA33_S10C4_SIZE                               0x1
#define _LCDDATA33_S10C4_LENGTH                             0x1
#define _LCDDATA33_S10C4_MASK                               0x4
#define _LCDDATA33_S11C4_POSN                               0x3
#define _LCDDATA33_S11C4_POSITION                           0x3
#define _LCDDATA33_S11C4_SIZE                               0x1
#define _LCDDATA33_S11C4_LENGTH                             0x1
#define _LCDDATA33_S11C4_MASK                               0x8
#define _LCDDATA33_S12C4_POSN                               0x4
#define _LCDDATA33_S12C4_POSITION                           0x4
#define _LCDDATA33_S12C4_SIZE                               0x1
#define _LCDDATA33_S12C4_LENGTH                             0x1
#define _LCDDATA33_S12C4_MASK                               0x10
#define _LCDDATA33_S13C4_POSN                               0x5
#define _LCDDATA33_S13C4_POSITION                           0x5
#define _LCDDATA33_S13C4_SIZE                               0x1
#define _LCDDATA33_S13C4_LENGTH                             0x1
#define _LCDDATA33_S13C4_MASK                               0x20
#define _LCDDATA33_S14C4_POSN                               0x6
#define _LCDDATA33_S14C4_POSITION                           0x6
#define _LCDDATA33_S14C4_SIZE                               0x1
#define _LCDDATA33_S14C4_LENGTH                             0x1
#define _LCDDATA33_S14C4_MASK                               0x40
#define _LCDDATA33_S15C4_POSN                               0x7
#define _LCDDATA33_S15C4_POSITION                           0x7
#define _LCDDATA33_S15C4_SIZE                               0x1
#define _LCDDATA33_S15C4_LENGTH                             0x1
#define _LCDDATA33_S15C4_MASK                               0x80

// Register: LCDDATA34
#define LCDDATA34 LCDDATA34
extern volatile unsigned char           LCDDATA34           __at(0xEB0);
#ifndef _LIB_BUILD
asm("LCDDATA34 equ 0EB0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S16C4                  :1;
        unsigned S17C4                  :1;
        unsigned S18C4                  :1;
        unsigned S19C4                  :1;
        unsigned S20C4                  :1;
        unsigned S21C4                  :1;
        unsigned S22C4                  :1;
        unsigned S23C4                  :1;
    };
} LCDDATA34bits_t;
