MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
extern volatile PORTKbits_t PORTKbits __at(0xEE7);
// bitfield macros
#define _PORTK_RK0_POSN                                     0x0
#define _PORTK_RK0_POSITION                                 0x0
#define _PORTK_RK0_SIZE                                     0x1
#define _PORTK_RK0_LENGTH                                   0x1
#define _PORTK_RK0_MASK                                     0x1
#define _PORTK_RK1_POSN                                     0x1
#define _PORTK_RK1_POSITION                                 0x1
#define _PORTK_RK1_SIZE                                     0x1
#define _PORTK_RK1_LENGTH                                   0x1
#define _PORTK_RK1_MASK                                     0x2
#define _PORTK_RK2_POSN                                     0x2
#define _PORTK_RK2_POSITION                                 0x2
#define _PORTK_RK2_SIZE                                     0x1
#define _PORTK_RK2_LENGTH                                   0x1
#define _PORTK_RK2_MASK                                     0x4
#define _PORTK_RK3_POSN                                     0x3
#define _PORTK_RK3_POSITION                                 0x3
#define _PORTK_RK3_SIZE                                     0x1
#define _PORTK_RK3_LENGTH                                   0x1
#define _PORTK_RK3_MASK                                     0x8
#define _PORTK_RK4_POSN                                     0x4
#define _PORTK_RK4_POSITION                                 0x4
#define _PORTK_RK4_SIZE                                     0x1
#define _PORTK_RK4_LENGTH                                   0x1
#define _PORTK_RK4_MASK                                     0x10
#define _PORTK_RK5_POSN                                     0x5
#define _PORTK_RK5_POSITION                                 0x5
#define _PORTK_RK5_SIZE                                     0x1
#define _PORTK_RK5_LENGTH                                   0x1
#define _PORTK_RK5_MASK                                     0x20
#define _PORTK_RK6_POSN                                     0x6
#define _PORTK_RK6_POSITION                                 0x6
#define _PORTK_RK6_SIZE                                     0x1
#define _PORTK_RK6_LENGTH                                   0x1
#define _PORTK_RK6_MASK                                     0x40
#define _PORTK_RK7_POSN                                     0x7
#define _PORTK_RK7_POSITION                                 0x7
#define _PORTK_RK7_SIZE                                     0x1
#define _PORTK_RK7_LENGTH                                   0x1
#define _PORTK_RK7_MASK                                     0x80

// Register: LATK
#define LATK LATK
extern volatile unsigned char           LATK                __at(0xEE8);
#ifndef _LIB_BUILD
asm("LATK equ 0EE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LATK0                  :1;
        unsigned LATK1                  :1;
        unsigned LATK2                  :1;
        unsigned LATK3                  :1;
        unsigned LATK4                  :1;
        unsigned LATK5                  :1;
        unsigned LATK6                  :1;
        unsigned LATK7                  :1;
    };
    struct {
        unsigned LK0                    :1;
        unsigned LK1                    :1;
        unsigned LK2                    :1;
        unsigned LK3                    :1;
        unsigned LK4                    :1;
        unsigned LK5                    :1;
        unsigned LK6                    :1;
        unsigned LK7                    :1;
    };
} LATKbits_t;
extern volatile LATKbits_t LATKbits __at(0xEE8);
// bitfield macros
#define _LATK_LATK0_POSN                                    0x0
#define _LATK_LATK0_POSITION                                0x0
#define _LATK_LATK0_SIZE                                    0x1
#define _LATK_LATK0_LENGTH                                  0x1
#define _LATK_LATK0_MASK                                    0x1
#define _LATK_LATK1_POSN                                    0x1
#define _LATK_LATK1_POSITION                                0x1
#define _LATK_LATK1_SIZE                                    0x1
#define _LATK_LATK1_LENGTH                                  0x1
#define _LATK_LATK1_MASK                                    0x2
#define _LATK_LATK2_POSN                                    0x2
#define _LATK_LATK2_POSITION                                0x2
#define _LATK_LATK2_SIZE                                    0x1
#define _LATK_LATK2_LENGTH                                  0x1
#define _LATK_LATK2_MASK                                    0x4
#define _LATK_LATK3_POSN                                    0x3
#define _LATK_LATK3_POSITION                                0x3
#define _LATK_LATK3_SIZE                                    0x1
#define _LATK_LATK3_LENGTH                                  0x1
#define _LATK_LATK3_MASK                                    0x8
#define _LATK_LATK4_POSN                                    0x4
#define _LATK_LATK4_POSITION                                0x4
#define _LATK_LATK4_SIZE                                    0x1
#define _LATK_LATK4_LENGTH                                  0x1
#define _LATK_LATK4_MASK                                    0x10
#define _LATK_LATK5_POSN                                    0x5
#define _LATK_LATK5_POSITION                                0x5
#define _LATK_LATK5_SIZE                                    0x1
#define _LATK_LATK5_LENGTH                                  0x1
#define _LATK_LATK5_MASK                                    0x20
#define _LATK_LATK6_POSN                                    0x6
#define _LATK_LATK6_POSITION                                0x6
#define _LATK_LATK6_SIZE                                    0x1
#define _LATK_LATK6_LENGTH                                  0x1
#define _LATK_LATK6_MASK                                    0x40
#define _LATK_LATK7_POSN                                    0x7
#define _LATK_LATK7_POSITION                                0x7
#define _LATK_LATK7_SIZE                                    0x1
#define _LATK_LATK7_LENGTH                                  0x1
#define _LATK_LATK7_MASK                                    0x80
#define _LATK_LK0_POSN                                      0x0
#define _LATK_LK0_POSITION                                  0x0
#define _LATK_LK0_SIZE                                      0x1
#define _LATK_LK0_LENGTH                                    0x1
#define _LATK_LK0_MASK                                      0x1
#define _LATK_LK1_POSN                                      0x1
#define _LATK_LK1_POSITION                                  0x1
#define _LATK_LK1_SIZE                                      0x1
#define _LATK_LK1_LENGTH                                    0x1
#define _LATK_LK1_MASK                                      0x2
#define _LATK_LK2_POSN                                      0x2
#define _LATK_LK2_POSITION                                  0x2
#define _LATK_LK2_SIZE                                      0x1
#define _LATK_LK2_LENGTH                                    0x1
#define _LATK_LK2_MASK                                      0x4
#define _LATK_LK3_POSN                                      0x3
#define _LATK_LK3_POSITION                                  0x3
#define _LATK_LK3_SIZE                                      0x1
#define _LATK_LK3_LENGTH                                    0x1
#define _LATK_LK3_MASK                                      0x8
#define _LATK_LK4_POSN                                      0x4
#define _LATK_LK4_POSITION                                  0x4
#define _LATK_LK4_SIZE                                      0x1
#define _LATK_LK4_LENGTH                                    0x1
#define _LATK_LK4_MASK                                      0x10
#define _LATK_LK5_POSN                                      0x5
#define _LATK_LK5_POSITION                                  0x5
#define _LATK_LK5_SIZE                                      0x1
#define _LATK_LK5_LENGTH                                    0x1
#define _LATK_LK5_MASK                                      0x20
#define _LATK_LK6_POSN                                      0x6
#define _LATK_LK6_POSITION                                  0x6
#define _LATK_LK6_SIZE                                      0x1
#define _LATK_LK6_LENGTH                                    0x1
#define _LATK_LK6_MASK                                      0x40
#define _LATK_LK7_POSN                                      0x7
#define _LATK_LK7_POSITION                                  0x7
#define _LATK_LK7_SIZE                                      0x1
#define _LATK_LK7_LENGTH                                    0x1
#define _LATK_LK7_MASK                                      0x80

// Register: TRISK
#define TRISK TRISK
extern volatile unsigned char           TRISK               __at(0xEE9);
#ifndef _LIB_BUILD
asm("TRISK equ 0EE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TRISK0                 :1;
        unsigned TRISK1                 :1;
        unsigned TRISK2                 :1;
        unsigned TRISK3                 :1;
        unsigned TRISK4                 :1;
        unsigned TRISK5                 :1;
        unsigned TRISK6                 :1;
        unsigned TRISK7                 :1;
    };
} TRISKbits_t;
extern volatile TRISKbits_t TRISKbits __at(0xEE9);
// bitfield macros
#define _TRISK_TRISK0_POSN                                  0x0
#define _TRISK_TRISK0_POSITION                              0x0
#define _TRISK_TRISK0_SIZE                                  0x1
#define _TRISK_TRISK0_LENGTH                                0x1
#define _TRISK_TRISK0_MASK                                  0x1
#define _TRISK_TRISK1_POSN                                  0x1
#define _TRISK_TRISK1_POSITION                              0x1
#define _TRISK_TRISK1_SIZE                                  0x1
#define _TRISK_TRISK1_LENGTH                                0x1
#define _TRISK_TRISK1_MASK                                  0x2
#define _TRISK_TRISK2_POSN                                  0x2
#define _TRISK_TRISK2_POSITION                              0x2
#define _TRISK_TRISK2_SIZE                                  0x1
#define _TRISK_TRISK2_LENGTH                                0x1
#define _TRISK_TRISK2_MASK                                  0x4
#define _TRISK_TRISK3_POSN                                  0x3
#define _TRISK_TRISK3_POSITION                              0x3
#define _TRISK_TRISK3_SIZE                                  0x1
#define _TRISK_TRISK3_LENGTH                                0x1
#define _TRISK_TRISK3_MASK                                  0x8
#define _TRISK_TRISK4_POSN                                  0x4
#define _TRISK_TRISK4_POSITION                              0x4
#define _TRISK_TRISK4_SIZE                                  0x1
#define _TRISK_TRISK4_LENGTH                                0x1
#define _TRISK_TRISK4_MASK                                  0x10
#define _TRISK_TRISK5_POSN                                  0x5
#define _TRISK_TRISK5_POSITION                              0x5
#define _TRISK_TRISK5_SIZE                                  0x1
#define _TRISK_TRISK5_LENGTH                                0x1
#define _TRISK_TRISK5_MASK                                  0x20
#define _TRISK_TRISK6_POSN                                  0x6
#define _TRISK_TRISK6_POSITION                              0x6
#define _TRISK_TRISK6_SIZE                                  0x1
#define _TRISK_TRISK6_LENGTH                                0x1
#define _TRISK_TRISK6_MASK                                  0x40
#define _TRISK_TRISK7_POSN                                  0x7
#define _TRISK_TRISK7_POSITION                              0x7
#define _TRISK_TRISK7_SIZE                                  0x1
#define _TRISK_TRISK7_LENGTH                                0x1
#define _TRISK_TRISK7_MASK                                  0x80

// Register: ODCON2
#define ODCON2 ODCON2
extern volatile unsigned char           ODCON2              __at(0xEEA);
#ifndef _LIB_BUILD
asm("ODCON2 equ 0EEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ECCP3OD                :1;
        unsigned CCP4OD                 :1;
        unsigned CCP5OD                 :1;
        unsigned CCP6OD                 :1;
        unsigned CCP7OD                 :1;
        unsigned CCP8OD                 :1;
        unsigned CCP9OD                 :1;
        unsigned CCP10OD                :1;
    };
} ODCON2bits_t;
extern volatile ODCON2bits_t ODCON2bits __at(0xEEA);
// bitfield macros
#define _ODCON2_ECCP3OD_POSN                                0x0
#define _ODCON2_ECCP3OD_POSITION                            0x0
#define _ODCON2_ECCP3OD_SIZE                                0x1
#define _ODCON2_ECCP3OD_LENGTH                              0x1
#define _ODCON2_ECCP3OD_MASK                                0x1
#define _ODCON2_CCP4OD_POSN                                 0x1
#define _ODCON2_CCP4OD_POSITION                             0x1
#define _ODCON2_CCP4OD_SIZE                                 0x1
#define _ODCON2_CCP4OD_LENGTH                               0x1
#define _ODCON2_CCP4OD_MASK                                 0x2
#define _ODCON2_CCP5OD_POSN                                 0x2
#define _ODCON2_CCP5OD_POSITION                             0x2
#define _ODCON2_CCP5OD_SIZE                                 0x1
#define _ODCON2_CCP5OD_LENGTH                               0x1
#define _ODCON2_CCP5OD_MASK                                 0x4
#define _ODCON2_CCP6OD_POSN                                 0x3
#define _ODCON2_CCP6OD_POSITION                             0x3
#define _ODCON2_CCP6OD_SIZE                                 0x1
#define _ODCON2_CCP6OD_LENGTH                               0x1
#define _ODCON2_CCP6OD_MASK                                 0x8
#define _ODCON2_CCP7OD_POSN                                 0x4
#define _ODCON2_CCP7OD_POSITION                             0x4
#define _ODCON2_CCP7OD_SIZE                                 0x1
#define _ODCON2_CCP7OD_LENGTH                               0x1
#define _ODCON2_CCP7OD_MASK                                 0x10
#define _ODCON2_CCP8OD_POSN                                 0x5
#define _ODCON2_CCP8OD_POSITION                             0x5
#define _ODCON2_CCP8OD_SIZE                                 0x1
#define _ODCON2_CCP8OD_LENGTH                               0x1
#define _ODCON2_CCP8OD_MASK                                 0x20
#define _ODCON2_CCP9OD_POSN                                 0x6
#define _ODCON2_CCP9OD_POSITION                             0x6
#define _ODCON2_CCP9OD_SIZE                                 0x1
#define _ODCON2_CCP9OD_LENGTH                               0x1
#define _ODCON2_CCP9OD_MASK                                 0x40
#define _ODCON2_CCP10OD_POSN                                0x7
#define _ODCON2_CCP10OD_POSITION                            0x7
#define _ODCON2_CCP10OD_SIZE                                0x1
#define _ODCON2_CCP10OD_LENGTH                              0x1
#define _ODCON2_CCP10OD_MASK                                0x80

// Register: ODCON1
#define ODCON1 ODCON1
extern volatile unsigned char           ODCON1              __at(0xEEB);
#ifndef _LIB_BUILD
asm("ODCON1 equ 0EEBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP1OD                 :1;
        unsigned SSP2OD                 :1;
        unsigned USART1OD               :1;
        unsigned USART2OD               :1;
        unsigned USART3OD               :1;
        unsigned USART4OD               :1;
        unsigned ECCP1OD                :1;
        unsigned ECCP2OD                :1;
    };
} ODCON1bits_t;
extern volatile ODCON1bits_t ODCON1bits __at(0xEEB);
// bitfield macros
#define _ODCON1_SSP1OD_POSN                                 0x0
#define _ODCON1_SSP1OD_POSITION                             0x0
#define _ODCON1_SSP1OD_SIZE                                 0x1
#define _ODCON1_SSP1OD_LENGTH                               0x1
#define _ODCON1_SSP1OD_MASK                                 0x1
#define _ODCON1_SSP2OD_POSN                                 0x1
#define _ODCON1_SSP2OD_POSITION                             0x1
#define _ODCON1_SSP2OD_SIZE                                 0x1
#define _ODCON1_SSP2OD_LENGTH                               0x1
#define _ODCON1_SSP2OD_MASK                                 0x2
#define _ODCON1_USART1OD_POSN                               0x2
#define _ODCON1_USART1OD_POSITION                           0x2
#define _ODCON1_USART1OD_SIZE                               0x1
#define _ODCON1_USART1OD_LENGTH                             0x1
#define _ODCON1_USART1OD_MASK                               0x4
#define _ODCON1_USART2OD_POSN                               0x3
#define _ODCON1_USART2OD_POSITION                           0x3
#define _ODCON1_USART2OD_SIZE                               0x1
#define _ODCON1_USART2OD_LENGTH                             0x1
#define _ODCON1_USART2OD_MASK                               0x8
#define _ODCON1_USART3OD_POSN                               0x4
#define _ODCON1_USART3OD_POSITION                           0x4
#define _ODCON1_USART3OD_SIZE                               0x1
#define _ODCON1_USART3OD_LENGTH                             0x1
#define _ODCON1_USART3OD_MASK                               0x10
#define _ODCON1_USART4OD_POSN                               0x5
#define _ODCON1_USART4OD_POSITION                           0x5
#define _ODCON1_USART4OD_SIZE                               0x1
#define _ODCON1_USART4OD_LENGTH                             0x1
#define _ODCON1_USART4OD_MASK                               0x20
#define _ODCON1_ECCP1OD_POSN                                0x6
#define _ODCON1_ECCP1OD_POSITION                            0x6
#define _ODCON1_ECCP1OD_SIZE                                0x1
#define _ODCON1_ECCP1OD_LENGTH                              0x1
#define _ODCON1_ECCP1OD_MASK                                0x40
#define _ODCON1_ECCP2OD_POSN                                0x7
#define _ODCON1_ECCP2OD_POSITION                            0x7
#define _ODCON1_ECCP2OD_SIZE                                0x1
#define _ODCON1_ECCP2OD_LENGTH                              0x1
#define _ODCON1_ECCP2OD_MASK                                0x80

// Register: MDCARL
#define MDCARL MDCARL
extern volatile unsigned char           MDCARL              __at(0xEEC);
#ifndef _LIB_BUILD
asm("MDCARL equ 0EECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCL                   :4;
        unsigned                        :1;
        unsigned MDCLSYNC               :1;
        unsigned MDCLPOL                :1;
        unsigned MDCLODIS               :1;
    };
    struct {
        unsigned MDCL0                  :1;
        unsigned MDCL1                  :1;
        unsigned MDCL2                  :1;
        unsigned MDCL3                  :1;
    };
} MDCARLbits_t;
extern volatile MDCARLbits_t MDCARLbits __at(0xEEC);
// bitfield macros
#define _MDCARL_MDCL_POSN                                   0x0
#define _MDCARL_MDCL_POSITION                               0x0
#define _MDCARL_MDCL_SIZE                                   0x4
#define _MDCARL_MDCL_LENGTH                                 0x4
#define _MDCARL_MDCL_MASK                                   0xF
#define _MDCARL_MDCLSYNC_POSN                               0x5
#define _MDCARL_MDCLSYNC_POSITION                           0x5
#define _MDCARL_MDCLSYNC_SIZE                               0x1
#define _MDCARL_MDCLSYNC_LENGTH                             0x1
#define _MDCARL_MDCLSYNC_MASK                               0x20
#define _MDCARL_MDCLPOL_POSN                                0x6
#define _MDCARL_MDCLPOL_POSITION                            0x6
#define _MDCARL_MDCLPOL_SIZE                                0x1
#define _MDCARL_MDCLPOL_LENGTH                              0x1
#define _MDCARL_MDCLPOL_MASK                                0x40
#define _MDCARL_MDCLODIS_POSN                               0x7
#define _MDCARL_MDCLODIS_POSITION                           0x7
#define _MDCARL_MDCLODIS_SIZE                               0x1
#define _MDCARL_MDCLODIS_LENGTH                             0x1
#define _MDCARL_MDCLODIS_MASK                               0x80
#define _MDCARL_MDCL0_POSN                                  0x0
#define _MDCARL_MDCL0_POSITION                              0x0
#define _MDCARL_MDCL0_SIZE                                  0x1
#define _MDCARL_MDCL0_LENGTH                                0x1
#define _MDCARL_MDCL0_MASK                                  0x1
#define _MDCARL_MDCL1_POSN                                  0x1
#define _MDCARL_MDCL1_POSITION                              0x1
#define _MDCARL_MDCL1_SIZE                                  0x1
#define _MDCARL_MDCL1_LENGTH                                0x1
#define _MDCARL_MDCL1_MASK                                  0x2
#define _MDCARL_MDCL2_POSN                                  0x2
#define _MDCARL_MDCL2_POSITION                              0x2
#define _MDCARL_MDCL2_SIZE                                  0x1
#define _MDCARL_MDCL2_LENGTH                                0x1
#define _MDCARL_MDCL2_MASK                                  0x4
#define _MDCARL_MDCL3_POSN                                  0x3
#define _MDCARL_MDCL3_POSITION                              0x3
#define _MDCARL_MDCL3_SIZE                                  0x1
#define _MDCARL_MDCL3_LENGTH                                0x1
#define _MDCARL_MDCL3_MASK                                  0x8

// Register: MDCARH
#define MDCARH MDCARH
extern volatile unsigned char           MDCARH              __at(0xEED);
#ifndef _LIB_BUILD
asm("MDCARH equ 0EEDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCH                   :4;
        unsigned                        :1;
        unsigned MDCHSYNC               :1;
        unsigned MDCHPOL                :1;
        unsigned MDCHODIS               :1;
    };
    struct {
        unsigned MDCH0                  :1;
        unsigned MDCH1                  :1;
        unsigned MDCH2                  :1;
        unsigned MDCH3                  :1;
    };
} MDCARHbits_t;
