MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: CTMUCON1
#define CTMUCON1 CTMUCON1
extern volatile unsigned char           CTMUCON1            __at(0xEF8);
#ifndef _LIB_BUILD
asm("CTMUCON1 equ 0EF8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CTTRIG                 :1;
        unsigned IDISSEN                :1;
        unsigned EDGSEQEN               :1;
        unsigned EDGEN                  :1;
        unsigned TGEN                   :1;
        unsigned CTMUSIDL               :1;
        unsigned                        :1;
        unsigned CTMUEN                 :1;
    };
} CTMUCON1bits_t;
extern volatile CTMUCON1bits_t CTMUCON1bits __at(0xEF8);
// bitfield macros
#define _CTMUCON1_CTTRIG_POSN                               0x0
#define _CTMUCON1_CTTRIG_POSITION                           0x0
#define _CTMUCON1_CTTRIG_SIZE                               0x1
#define _CTMUCON1_CTTRIG_LENGTH                             0x1
#define _CTMUCON1_CTTRIG_MASK                               0x1
#define _CTMUCON1_IDISSEN_POSN                              0x1
#define _CTMUCON1_IDISSEN_POSITION                          0x1
#define _CTMUCON1_IDISSEN_SIZE                              0x1
#define _CTMUCON1_IDISSEN_LENGTH                            0x1
#define _CTMUCON1_IDISSEN_MASK                              0x2
#define _CTMUCON1_EDGSEQEN_POSN                             0x2
#define _CTMUCON1_EDGSEQEN_POSITION                         0x2
#define _CTMUCON1_EDGSEQEN_SIZE                             0x1
#define _CTMUCON1_EDGSEQEN_LENGTH                           0x1
#define _CTMUCON1_EDGSEQEN_MASK                             0x4
#define _CTMUCON1_EDGEN_POSN                                0x3
#define _CTMUCON1_EDGEN_POSITION                            0x3
#define _CTMUCON1_EDGEN_SIZE                                0x1
#define _CTMUCON1_EDGEN_LENGTH                              0x1
#define _CTMUCON1_EDGEN_MASK                                0x8
#define _CTMUCON1_TGEN_POSN                                 0x4
#define _CTMUCON1_TGEN_POSITION                             0x4
#define _CTMUCON1_TGEN_SIZE                                 0x1
#define _CTMUCON1_TGEN_LENGTH                               0x1
#define _CTMUCON1_TGEN_MASK                                 0x10
#define _CTMUCON1_CTMUSIDL_POSN                             0x5
#define _CTMUCON1_CTMUSIDL_POSITION                         0x5
#define _CTMUCON1_CTMUSIDL_SIZE                             0x1
#define _CTMUCON1_CTMUSIDL_LENGTH                           0x1
#define _CTMUCON1_CTMUSIDL_MASK                             0x20
#define _CTMUCON1_CTMUEN_POSN                               0x7
#define _CTMUCON1_CTMUEN_POSITION                           0x7
#define _CTMUCON1_CTMUEN_SIZE                               0x1
#define _CTMUCON1_CTMUEN_LENGTH                             0x1
#define _CTMUCON1_CTMUEN_MASK                               0x80

// Register: TXREG4
#define TXREG4 TXREG4
extern volatile unsigned char           TXREG4              __at(0xEF9);
#ifndef _LIB_BUILD
asm("TXREG4 equ 0EF9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXREG4                 :8;
    };
} TXREG4bits_t;
extern volatile TXREG4bits_t TXREG4bits __at(0xEF9);
// bitfield macros
#define _TXREG4_TXREG4_POSN                                 0x0
#define _TXREG4_TXREG4_POSITION                             0x0
#define _TXREG4_TXREG4_SIZE                                 0x8
#define _TXREG4_TXREG4_LENGTH                               0x8
#define _TXREG4_TXREG4_MASK                                 0xFF

// Register: RCREG4
#define RCREG4 RCREG4
extern volatile unsigned char           RCREG4              __at(0xEFA);
#ifndef _LIB_BUILD
asm("RCREG4 equ 0EFAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RCREG4                 :8;
    };
} RCREG4bits_t;
extern volatile RCREG4bits_t RCREG4bits __at(0xEFA);
// bitfield macros
#define _RCREG4_RCREG4_POSN                                 0x0
#define _RCREG4_RCREG4_POSITION                             0x0
#define _RCREG4_RCREG4_SIZE                                 0x8
#define _RCREG4_RCREG4_LENGTH                               0x8
#define _RCREG4_RCREG4_MASK                                 0xFF

// Register: SPBRG4
#define SPBRG4 SPBRG4
extern volatile unsigned char           SPBRG4              __at(0xEFB);
#ifndef _LIB_BUILD
asm("SPBRG4 equ 0EFBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRG4                 :8;
    };
    struct {
        unsigned BRG0                   :1;
        unsigned BRG1                   :1;
        unsigned BRG2                   :1;
        unsigned BRG3                   :1;
        unsigned BRG4                   :1;
        unsigned BRG5                   :1;
        unsigned BRG6                   :1;
        unsigned BRG7                   :1;
    };
} SPBRG4bits_t;
extern volatile SPBRG4bits_t SPBRG4bits __at(0xEFB);
// bitfield macros
#define _SPBRG4_SPBRG4_POSN                                 0x0
#define _SPBRG4_SPBRG4_POSITION                             0x0
#define _SPBRG4_SPBRG4_SIZE                                 0x8
#define _SPBRG4_SPBRG4_LENGTH                               0x8
#define _SPBRG4_SPBRG4_MASK                                 0xFF
#define _SPBRG4_BRG0_POSN                                   0x0
#define _SPBRG4_BRG0_POSITION                               0x0
#define _SPBRG4_BRG0_SIZE                                   0x1
#define _SPBRG4_BRG0_LENGTH                                 0x1
#define _SPBRG4_BRG0_MASK                                   0x1
#define _SPBRG4_BRG1_POSN                                   0x1
#define _SPBRG4_BRG1_POSITION                               0x1
#define _SPBRG4_BRG1_SIZE                                   0x1
#define _SPBRG4_BRG1_LENGTH                                 0x1
#define _SPBRG4_BRG1_MASK                                   0x2
#define _SPBRG4_BRG2_POSN                                   0x2
#define _SPBRG4_BRG2_POSITION                               0x2
#define _SPBRG4_BRG2_SIZE                                   0x1
#define _SPBRG4_BRG2_LENGTH                                 0x1
#define _SPBRG4_BRG2_MASK                                   0x4
#define _SPBRG4_BRG3_POSN                                   0x3
#define _SPBRG4_BRG3_POSITION                               0x3
#define _SPBRG4_BRG3_SIZE                                   0x1
#define _SPBRG4_BRG3_LENGTH                                 0x1
#define _SPBRG4_BRG3_MASK                                   0x8
#define _SPBRG4_BRG4_POSN                                   0x4
#define _SPBRG4_BRG4_POSITION                               0x4
#define _SPBRG4_BRG4_SIZE                                   0x1
#define _SPBRG4_BRG4_LENGTH                                 0x1
#define _SPBRG4_BRG4_MASK                                   0x10
#define _SPBRG4_BRG5_POSN                                   0x5
#define _SPBRG4_BRG5_POSITION                               0x5
#define _SPBRG4_BRG5_SIZE                                   0x1
#define _SPBRG4_BRG5_LENGTH                                 0x1
#define _SPBRG4_BRG5_MASK                                   0x20
#define _SPBRG4_BRG6_POSN                                   0x6
#define _SPBRG4_BRG6_POSITION                               0x6
#define _SPBRG4_BRG6_SIZE                                   0x1
#define _SPBRG4_BRG6_LENGTH                                 0x1
#define _SPBRG4_BRG6_MASK                                   0x40
#define _SPBRG4_BRG7_POSN                                   0x7
#define _SPBRG4_BRG7_POSITION                               0x7
#define _SPBRG4_BRG7_SIZE                                   0x1
#define _SPBRG4_BRG7_LENGTH                                 0x1
#define _SPBRG4_BRG7_MASK                                   0x80

// Register: SPBRGH4
#define SPBRGH4 SPBRGH4
extern volatile unsigned char           SPBRGH4             __at(0xEFC);
#ifndef _LIB_BUILD
asm("SPBRGH4 equ 0EFCh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPBRGH4                :8;
    };
    struct {
        unsigned BRG8                   :1;
        unsigned BRG9                   :1;
        unsigned BRG10                  :1;
        unsigned BRG11                  :1;
        unsigned BRG12                  :1;
        unsigned BRG13                  :1;
        unsigned BRG14                  :1;
        unsigned BRG15                  :1;
    };
} SPBRGH4bits_t;
