MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
// Register: DMACON1
#define DMACON1 DMACON1
extern volatile unsigned char           DMACON1             __at(0xF60);
#ifndef _LIB_BUILD
asm("DMACON1 equ 0F60h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DMAEN                  :1;
        unsigned DLYINTEN               :1;
        unsigned DUPLEX                 :2;
        unsigned RXINC                  :1;
        unsigned TXINC                  :1;
        unsigned SSCON                  :2;
    };
    struct {
        unsigned                        :2;
        unsigned DUPLEX0                :1;
        unsigned DUPLEX1                :1;
        unsigned                        :2;
        unsigned SSCON0                 :1;
        unsigned SSCON1                 :1;
    };
} DMACON1bits_t;
extern volatile DMACON1bits_t DMACON1bits __at(0xF60);
// bitfield macros
#define _DMACON1_DMAEN_POSN                                 0x0
#define _DMACON1_DMAEN_POSITION                             0x0
#define _DMACON1_DMAEN_SIZE                                 0x1
#define _DMACON1_DMAEN_LENGTH                               0x1
#define _DMACON1_DMAEN_MASK                                 0x1
#define _DMACON1_DLYINTEN_POSN                              0x1
#define _DMACON1_DLYINTEN_POSITION                          0x1
#define _DMACON1_DLYINTEN_SIZE                              0x1
#define _DMACON1_DLYINTEN_LENGTH                            0x1
#define _DMACON1_DLYINTEN_MASK                              0x2
#define _DMACON1_DUPLEX_POSN                                0x2
#define _DMACON1_DUPLEX_POSITION                            0x2
#define _DMACON1_DUPLEX_SIZE                                0x2
#define _DMACON1_DUPLEX_LENGTH                              0x2
#define _DMACON1_DUPLEX_MASK                                0xC
#define _DMACON1_RXINC_POSN                                 0x4
#define _DMACON1_RXINC_POSITION                             0x4
#define _DMACON1_RXINC_SIZE                                 0x1
#define _DMACON1_RXINC_LENGTH                               0x1
#define _DMACON1_RXINC_MASK                                 0x10
#define _DMACON1_TXINC_POSN                                 0x5
#define _DMACON1_TXINC_POSITION                             0x5
#define _DMACON1_TXINC_SIZE                                 0x1
#define _DMACON1_TXINC_LENGTH                               0x1
#define _DMACON1_TXINC_MASK                                 0x20
#define _DMACON1_SSCON_POSN                                 0x6
#define _DMACON1_SSCON_POSITION                             0x6
#define _DMACON1_SSCON_SIZE                                 0x2
#define _DMACON1_SSCON_LENGTH                               0x2
#define _DMACON1_SSCON_MASK                                 0xC0
#define _DMACON1_DUPLEX0_POSN                               0x2
#define _DMACON1_DUPLEX0_POSITION                           0x2
#define _DMACON1_DUPLEX0_SIZE                               0x1
#define _DMACON1_DUPLEX0_LENGTH                             0x1
#define _DMACON1_DUPLEX0_MASK                               0x4
#define _DMACON1_DUPLEX1_POSN                               0x3
#define _DMACON1_DUPLEX1_POSITION                           0x3
#define _DMACON1_DUPLEX1_SIZE                               0x1
#define _DMACON1_DUPLEX1_LENGTH                             0x1
#define _DMACON1_DUPLEX1_MASK                               0x8
#define _DMACON1_SSCON0_POSN                                0x6
#define _DMACON1_SSCON0_POSITION                            0x6
#define _DMACON1_SSCON0_SIZE                                0x1
#define _DMACON1_SSCON0_LENGTH                              0x1
#define _DMACON1_SSCON0_MASK                                0x40
#define _DMACON1_SSCON1_POSN                                0x7
#define _DMACON1_SSCON1_POSITION                            0x7
#define _DMACON1_SSCON1_SIZE                                0x1
#define _DMACON1_SSCON1_LENGTH                              0x1
#define _DMACON1_SSCON1_MASK                                0x80

// Register: PIE6
#define PIE6 PIE6
extern volatile unsigned char           PIE6                __at(0xF61);
#ifndef _LIB_BUILD
asm("PIE6 equ 0F61h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1IE                 :1;
        unsigned CMP2IE                 :1;
        unsigned CMP3IE                 :1;
        unsigned                        :1;
        unsigned TX3IE                  :1;
        unsigned RC3IE                  :1;
        unsigned TX4IE                  :1;
        unsigned RC4IE                  :1;
    };
} PIE6bits_t;
extern volatile PIE6bits_t PIE6bits __at(0xF61);
// bitfield macros
#define _PIE6_CMP1IE_POSN                                   0x0
#define _PIE6_CMP1IE_POSITION                               0x0
#define _PIE6_CMP1IE_SIZE                                   0x1
#define _PIE6_CMP1IE_LENGTH                                 0x1
#define _PIE6_CMP1IE_MASK                                   0x1
#define _PIE6_CMP2IE_POSN                                   0x1
#define _PIE6_CMP2IE_POSITION                               0x1
#define _PIE6_CMP2IE_SIZE                                   0x1
#define _PIE6_CMP2IE_LENGTH                                 0x1
#define _PIE6_CMP2IE_MASK                                   0x2
#define _PIE6_CMP3IE_POSN                                   0x2
#define _PIE6_CMP3IE_POSITION                               0x2
#define _PIE6_CMP3IE_SIZE                                   0x1
#define _PIE6_CMP3IE_LENGTH                                 0x1
#define _PIE6_CMP3IE_MASK                                   0x4
#define _PIE6_TX3IE_POSN                                    0x4
#define _PIE6_TX3IE_POSITION                                0x4
#define _PIE6_TX3IE_SIZE                                    0x1
#define _PIE6_TX3IE_LENGTH                                  0x1
#define _PIE6_TX3IE_MASK                                    0x10
#define _PIE6_RC3IE_POSN                                    0x5
#define _PIE6_RC3IE_POSITION                                0x5
#define _PIE6_RC3IE_SIZE                                    0x1
#define _PIE6_RC3IE_LENGTH                                  0x1
#define _PIE6_RC3IE_MASK                                    0x20
#define _PIE6_TX4IE_POSN                                    0x6
#define _PIE6_TX4IE_POSITION                                0x6
#define _PIE6_TX4IE_SIZE                                    0x1
#define _PIE6_TX4IE_LENGTH                                  0x1
#define _PIE6_TX4IE_MASK                                    0x40
#define _PIE6_RC4IE_POSN                                    0x7
#define _PIE6_RC4IE_POSITION                                0x7
#define _PIE6_RC4IE_SIZE                                    0x1
#define _PIE6_RC4IE_LENGTH                                  0x1
#define _PIE6_RC4IE_MASK                                    0x80

// Register: WPUB
#define WPUB WPUB
extern volatile unsigned char           WPUB                __at(0xF62);
#ifndef _LIB_BUILD
asm("WPUB equ 0F62h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUB0                  :1;
        unsigned WPUB1                  :1;
        unsigned WPUB2                  :1;
        unsigned WPUB3                  :1;
        unsigned WPUB4                  :1;
        unsigned WPUB5                  :1;
        unsigned WPUB6                  :1;
        unsigned WPUB7                  :1;
    };
} WPUBbits_t;
extern volatile WPUBbits_t WPUBbits __at(0xF62);
// bitfield macros
#define _WPUB_WPUB0_POSN                                    0x0
#define _WPUB_WPUB0_POSITION                                0x0
#define _WPUB_WPUB0_SIZE                                    0x1
#define _WPUB_WPUB0_LENGTH                                  0x1
#define _WPUB_WPUB0_MASK                                    0x1
#define _WPUB_WPUB1_POSN                                    0x1
#define _WPUB_WPUB1_POSITION                                0x1
#define _WPUB_WPUB1_SIZE                                    0x1
#define _WPUB_WPUB1_LENGTH                                  0x1
#define _WPUB_WPUB1_MASK                                    0x2
#define _WPUB_WPUB2_POSN                                    0x2
#define _WPUB_WPUB2_POSITION                                0x2
#define _WPUB_WPUB2_SIZE                                    0x1
#define _WPUB_WPUB2_LENGTH                                  0x1
#define _WPUB_WPUB2_MASK                                    0x4
#define _WPUB_WPUB3_POSN                                    0x3
#define _WPUB_WPUB3_POSITION                                0x3
#define _WPUB_WPUB3_SIZE                                    0x1
#define _WPUB_WPUB3_LENGTH                                  0x1
#define _WPUB_WPUB3_MASK                                    0x8
#define _WPUB_WPUB4_POSN                                    0x4
#define _WPUB_WPUB4_POSITION                                0x4
#define _WPUB_WPUB4_SIZE                                    0x1
#define _WPUB_WPUB4_LENGTH                                  0x1
#define _WPUB_WPUB4_MASK                                    0x10
#define _WPUB_WPUB5_POSN                                    0x5
#define _WPUB_WPUB5_POSITION                                0x5
#define _WPUB_WPUB5_SIZE                                    0x1
#define _WPUB_WPUB5_LENGTH                                  0x1
#define _WPUB_WPUB5_MASK                                    0x20
#define _WPUB_WPUB6_POSN                                    0x6
#define _WPUB_WPUB6_POSITION                                0x6
#define _WPUB_WPUB6_SIZE                                    0x1
#define _WPUB_WPUB6_LENGTH                                  0x1
#define _WPUB_WPUB6_MASK                                    0x40
#define _WPUB_WPUB7_POSN                                    0x7
#define _WPUB_WPUB7_POSITION                                0x7
#define _WPUB_WPUB7_SIZE                                    0x1
#define _WPUB_WPUB7_LENGTH                                  0x1
#define _WPUB_WPUB7_MASK                                    0x80

// Register: ACTCON
#define ACTCON ACTCON
extern volatile unsigned char           ACTCON              __at(0xF63);
#ifndef _LIB_BUILD
asm("ACTCON equ 0F63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACTORSPOL              :1;
        unsigned ACTORS                 :1;
        unsigned ACTLOCKPOL             :1;
        unsigned ACTLOCK                :1;
        unsigned ACTSRC                 :1;
        unsigned ACTSIDL                :1;
        unsigned                        :1;
        unsigned ACTEN                  :1;
    };
} ACTCONbits_t;
