MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
#define                                 BC8_bit             _BIT_ACCESS(DMABCH,0)
// DMABCH<BC9>
extern volatile __bit                   BC9                 __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 BC9_bit             _BIT_ACCESS(DMABCH,1)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// IPR2<BCL1IP>
extern volatile __bit                   BCL1IP              __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCL1IP_bit          _BIT_ACCESS(IPR2,3)
// PIE2<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x7D05);	// @ (0xFA0 * 8 + 5)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE2,5)
// PIR2<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x7D0D);	// @ (0xFA1 * 8 + 5)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR2,5)
// IPR2<BCL2IP>
extern volatile __bit                   BCL2IP              __at(0x7D15);	// @ (0xFA2 * 8 + 5)
#define                                 BCL2IP_bit          _BIT_ACCESS(IPR2,5)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP2STAT<BF2>
extern volatile __bit                   BF2                 __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 BF2_bit             _BIT_ACCESS(SSP2STAT,0)
// HLVDCON<BGVST>
extern volatile __bit                   BGVST               __at(0x7D46);	// @ (0xFA8 * 8 + 6)
#define                                 BGVST_bit           _BIT_ACCESS(HLVDCON,6)
// LCDREG<BIAS0>
extern volatile __bit                   BIAS0               __at(0x76C3);	// @ (0xED8 * 8 + 3)
#define                                 BIAS0_bit           _BIT_ACCESS(LCDREG,3)
// LCDREG<BIAS1>
extern volatile __bit                   BIAS1               __at(0x76C4);	// @ (0xED8 * 8 + 4)
#define                                 BIAS1_bit           _BIT_ACCESS(LCDREG,4)
// LCDREG<BIAS2>
extern volatile __bit                   BIAS2               __at(0x76C5);	// @ (0xED8 * 8 + 5)
#define                                 BIAS2_bit           _BIT_ACCESS(LCDREG,5)
// LCDPS<BIASMD>
extern volatile __bit                   BIASMD              __at(0x76D6);	// @ (0xEDA * 8 + 6)
#define                                 BIASMD_bit          _BIT_ACCESS(LCDPS,6)
// BAUDCON1<BRG161>
extern volatile __bit                   BRG161              __at(0x7B3B);	// @ (0xF67 * 8 + 3)
#define                                 BRG161_bit          _BIT_ACCESS(BAUDCON1,3)
// BAUDCON2<BRG162>
extern volatile __bit                   BRG162              __at(0x798B);	// @ (0xF31 * 8 + 3)
#define                                 BRG162_bit          _BIT_ACCESS(BAUDCON2,3)
// BAUDCON3<BRG163>
extern volatile __bit                   BRG163              __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 BRG163_bit          _BIT_ACCESS(BAUDCON3,3)
// BAUDCON4<BRG164>
extern volatile __bit                   BRG164              __at(0x77EB);	// @ (0xEFD * 8 + 3)
#define                                 BRG164_bit          _BIT_ACCESS(BAUDCON4,3)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// UEIE<BTOEE>
extern volatile __bit                   BTOEE               __at(0x707C);	// @ (0xE0F * 8 + 4)
#define                                 BTOEE_bit           _BIT_ACCESS(UEIE,4)
// UEIR<BTOEF>
extern volatile __bit                   BTOEF               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 BTOEF_bit           _BIT_ACCESS(UEIR,4)
// UEIE<BTSEE>
extern volatile __bit                   BTSEE               __at(0x707F);	// @ (0xE0F * 8 + 7)
#define                                 BTSEE_bit           _BIT_ACCESS(UEIE,7)
// UEIR<BTSEF>
extern volatile __bit                   BTSEF               __at(0x7BBF);	// @ (0xF77 * 8 + 7)
#define                                 BTSEF_bit           _BIT_ACCESS(UEIR,7)
// ADCON2L<BUFM>
extern volatile __bit                   BUFM                __at(0x7461);	// @ (0xE8C * 8 + 1)
#define                                 BUFM_bit            _BIT_ACCESS(ADCON2L,1)
// ADCON2H<BUFREGEN>
extern volatile __bit                   BUFREGEN            __at(0x746B);	// @ (0xE8D * 8 + 3)
#define                                 BUFREGEN_bit        _BIT_ACCESS(ADCON2H,3)
// ADCON2L<BUFS>
extern volatile __bit                   BUFS                __at(0x7467);	// @ (0xE8C * 8 + 7)
#define                                 BUFS_bit            _BIT_ACCESS(ADCON2L,7)
// CCPTMRS2<C10TSEL>
extern volatile __bit                   C10TSEL             __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 C10TSEL_bit         _BIT_ACCESS(CCPTMRS2,4)
// CCPTMRS2<C10TSEL0>
extern volatile __bit                   C10TSEL0            __at(0x79A4);	// @ (0xF34 * 8 + 4)
#define                                 C10TSEL0_bit        _BIT_ACCESS(CCPTMRS2,4)
// CM1CON<C1CH0>
extern volatile __bit                   C1CH0               __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON,0)
// CM1CON<C1CH1>
extern volatile __bit                   C1CH1               __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON,1)
// CMSTAT<C1OUT>
extern volatile __bit                   C1OUT               __at(0x7E20);	// @ (0xFC4 * 8 + 0)
#define                                 C1OUT_bit           _BIT_ACCESS(CMSTAT,0)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x79B0);	// @ (0xF36 * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x79B1);	// @ (0xF36 * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CCPTMRS0<C1TSEL2>
extern volatile __bit                   C1TSEL2             __at(0x79B2);	// @ (0xF36 * 8 + 2)
#define                                 C1TSEL2_bit         _BIT_ACCESS(CCPTMRS0,2)
// CMSTAT<C2OUT>
extern volatile __bit                   C2OUT               __at(0x7E21);	// @ (0xFC4 * 8 + 1)
#define                                 C2OUT_bit           _BIT_ACCESS(CMSTAT,1)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x79B3);	// @ (0xF36 * 8 + 3)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,3)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x79B4);	// @ (0xF36 * 8 + 4)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C2TSEL2>
extern volatile __bit                   C2TSEL2             __at(0x79B5);	// @ (0xF36 * 8 + 5)
#define                                 C2TSEL2_bit         _BIT_ACCESS(CCPTMRS0,5)
// CMSTAT<C3OUT>
extern volatile __bit                   C3OUT               __at(0x7E22);	// @ (0xFC4 * 8 + 2)
#define                                 C3OUT_bit           _BIT_ACCESS(CMSTAT,2)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x79B6);	// @ (0xF36 * 8 + 6)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,6)
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x79B7);	// @ (0xF36 * 8 + 7)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,7)
// CCPTMRS1<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x79A8);	// @ (0xF35 * 8 + 0)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x79A9);	// @ (0xF35 * 8 + 1)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<C5TSEL>
extern volatile __bit                   C5TSEL              __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 C5TSEL_bit          _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<C5TSEL0>
extern volatile __bit                   C5TSEL0             __at(0x79AA);	// @ (0xF35 * 8 + 2)
#define                                 C5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<C6TSEL>
extern volatile __bit                   C6TSEL              __at(0x79AC);	// @ (0xF35 * 8 + 4)
#define                                 C6TSEL_bit          _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<C6TSEL0>
extern volatile __bit                   C6TSEL0             __at(0x79AC);	// @ (0xF35 * 8 + 4)
#define                                 C6TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<C7TSEL0>
extern volatile __bit                   C7TSEL0             __at(0x79AE);	// @ (0xF35 * 8 + 6)
#define                                 C7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,6)
// CCPTMRS1<C7TSEL1>
extern volatile __bit                   C7TSEL1             __at(0x79AF);	// @ (0xF35 * 8 + 7)
#define                                 C7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,7)
// CCPTMRS2<C8TSEL0>
extern volatile __bit                   C8TSEL0             __at(0x79A0);	// @ (0xF34 * 8 + 0)
#define                                 C8TSEL0_bit         _BIT_ACCESS(CCPTMRS2,0)
// CCPTMRS2<C8TSEL1>
extern volatile __bit                   C8TSEL1             __at(0x79A1);	// @ (0xF34 * 8 + 1)
#define                                 C8TSEL1_bit         _BIT_ACCESS(CCPTMRS2,1)
// CCPTMRS2<C9TSEL>
extern volatile __bit                   C9TSEL              __at(0x79A2);	// @ (0xF34 * 8 + 2)
#define                                 C9TSEL_bit          _BIT_ACCESS(CCPTMRS2,2)
// CCPTMRS2<C9TSEL0>
extern volatile __bit                   C9TSEL0             __at(0x79A2);	// @ (0xF34 * 8 + 2)
#define                                 C9TSEL0_bit         _BIT_ACCESS(CCPTMRS2,2)
// RTCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 CAL0_bit            _BIT_ACCESS(RTCCAL,0)
// RTCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 CAL1_bit            _BIT_ACCESS(RTCCAL,1)
// RTCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 CAL2_bit            _BIT_ACCESS(RTCCAL,2)
// RTCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 CAL3_bit            _BIT_ACCESS(RTCCAL,3)
// RTCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 CAL4_bit            _BIT_ACCESS(RTCCAL,4)
// RTCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 CAL5_bit            _BIT_ACCESS(RTCCAL,5)
// RTCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 CAL6_bit            _BIT_ACCESS(RTCCAL,6)
// RTCCAL<CAL7>
extern volatile __bit                   CAL7                __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 CAL7_bit            _BIT_ACCESS(RTCCAL,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON<CCH01>
extern volatile __bit                   CCH01               __at(0x7A98);	// @ (0xF53 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON,0)
// CM2CON<CCH02>
extern volatile __bit                   CCH02               __at(0x79C0);	// @ (0xF38 * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON,0)
// CM3CON<CCH03>
extern volatile __bit                   CCH03               __at(0x79B8);	// @ (0xF37 * 8 + 0)
#define                                 CCH03_bit           _BIT_ACCESS(CM3CON,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// CM1CON<CCH11>
extern volatile __bit                   CCH11               __at(0x7A99);	// @ (0xF53 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON,1)
// CM2CON<CCH12>
extern volatile __bit                   CCH12               __at(0x79C1);	// @ (0xF38 * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON,1)
// CM3CON<CCH13>
extern volatile __bit                   CCH13               __at(0x79B9);	// @ (0xF37 * 8 + 1)
#define                                 CCH13_bit           _BIT_ACCESS(CM3CON,1)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE4<CCP10IE>
extern volatile __bit                   CCP10IE             __at(0x7DA7);	// @ (0xFB4 * 8 + 7)
#define                                 CCP10IE_bit         _BIT_ACCESS(PIE4,7)
// PIR4<CCP10IF>
extern volatile __bit                   CCP10IF             __at(0x7DAF);	// @ (0xFB5 * 8 + 7)
#define                                 CCP10IF_bit         _BIT_ACCESS(PIR4,7)
// IPR4<CCP10IP>
extern volatile __bit                   CCP10IP             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 CCP10IP_bit         _BIT_ACCESS(IPR4,7)
// CCP10CON<CCP10M0>
extern volatile __bit                   CCP10M0             __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 CCP10M0_bit         _BIT_ACCESS(CCP10CON,0)
// CCP10CON<CCP10M1>
extern volatile __bit                   CCP10M1             __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 CCP10M1_bit         _BIT_ACCESS(CCP10CON,1)
// CCP10CON<CCP10M2>
extern volatile __bit                   CCP10M2             __at(0x7A02);	// @ (0xF40 * 8 + 2)
#define                                 CCP10M2_bit         _BIT_ACCESS(CCP10CON,2)
// CCP10CON<CCP10M3>
extern volatile __bit                   CCP10M3             __at(0x7A03);	// @ (0xF40 * 8 + 3)
#define                                 CCP10M3_bit         _BIT_ACCESS(CCP10CON,3)
// PMD0<CCP10MD>
extern volatile __bit                   CCP10MD             __at(0x77A7);	// @ (0xEF4 * 8 + 7)
#define                                 CCP10MD_bit         _BIT_ACCESS(PMD0,7)
// ODCON2<CCP10OD>
extern volatile __bit                   CCP10OD             __at(0x7757);	// @ (0xEEA * 8 + 7)
#define                                 CCP10OD_bit         _BIT_ACCESS(ODCON2,7)
// RPINR38_39<CCP10R0>
extern volatile __bit                   CCP10R0             __at(0x71E8);	// @ (0xE3D * 8 + 0)
#define                                 CCP10R0_bit         _BIT_ACCESS(RPINR38_39,0)
// RPINR38_39<CCP10R1>
extern volatile __bit                   CCP10R1             __at(0x71E9);	// @ (0xE3D * 8 + 1)
#define                                 CCP10R1_bit         _BIT_ACCESS(RPINR38_39,1)
// RPINR38_39<CCP10R2>
extern volatile __bit                   CCP10R2             __at(0x71EA);	// @ (0xE3D * 8 + 2)
#define                                 CCP10R2_bit         _BIT_ACCESS(RPINR38_39,2)
// RPINR38_39<CCP10R3>
extern volatile __bit                   CCP10R3             __at(0x71EB);	// @ (0xE3D * 8 + 3)
#define                                 CCP10R3_bit         _BIT_ACCESS(RPINR38_39,3)
// CCP10CON<CCP10X>
extern volatile __bit                   CCP10X              __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 CCP10X_bit          _BIT_ACCESS(CCP10CON,5)
// CCP10CON<CCP10Y>
extern volatile __bit                   CCP10Y              __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 CCP10Y_bit          _BIT_ACCESS(CCP10CON,4)
// PIE3<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR3,1)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DC8);	// @ (0xFB9 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DC9);	// @ (0xFB9 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DCA);	// @ (0xFB9 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DCB);	// @ (0xFB9 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DCD);	// @ (0xFB9 * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DCC);	// @ (0xFB9 * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTC<CCP2>
extern volatile __bit                   CCP2                __at(0x7C11);	// @ (0xF82 * 8 + 1)
#define                                 CCP2_bit            _BIT_ACCESS(PORTC,1)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE3<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR3,2)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// CCP3CON<CCP3M0>
extern volatile __bit                   CCP3M0              __at(0x7A48);	// @ (0xF49 * 8 + 0)
#define                                 CCP3M0_bit          _BIT_ACCESS(CCP3CON,0)
// CCP3CON<CCP3M1>
extern volatile __bit                   CCP3M1              __at(0x7A49);	// @ (0xF49 * 8 + 1)
#define                                 CCP3M1_bit          _BIT_ACCESS(CCP3CON,1)
// CCP3CON<CCP3M2>
extern volatile __bit                   CCP3M2              __at(0x7A4A);	// @ (0xF49 * 8 + 2)
#define                                 CCP3M2_bit          _BIT_ACCESS(CCP3CON,2)
// CCP3CON<CCP3M3>
extern volatile __bit                   CCP3M3              __at(0x7A4B);	// @ (0xF49 * 8 + 3)
#define                                 CCP3M3_bit          _BIT_ACCESS(CCP3CON,3)
// CCP3CON<CCP3X>
extern volatile __bit                   CCP3X               __at(0x7A4D);	// @ (0xF49 * 8 + 5)
#define                                 CCP3X_bit           _BIT_ACCESS(CCP3CON,5)
// CCP3CON<CCP3Y>
extern volatile __bit                   CCP3Y               __at(0x7A4C);	// @ (0xF49 * 8 + 4)
#define                                 CCP3Y_bit           _BIT_ACCESS(CCP3CON,4)
// PIE4<CCP4IE>
extern volatile __bit                   CCP4IE              __at(0x7DA1);	// @ (0xFB4 * 8 + 1)
#define                                 CCP4IE_bit          _BIT_ACCESS(PIE4,1)
// PIR4<CCP4IF>
extern volatile __bit                   CCP4IF              __at(0x7DA9);	// @ (0xFB5 * 8 + 1)
#define                                 CCP4IF_bit          _BIT_ACCESS(PIR4,1)
// IPR4<CCP4IP>
extern volatile __bit                   CCP4IP              __at(0x7DB1);	// @ (0xFB6 * 8 + 1)
#define                                 CCP4IP_bit          _BIT_ACCESS(IPR4,1)
// CCP4CON<CCP4M0>
extern volatile __bit                   CCP4M0              __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 CCP4M0_bit          _BIT_ACCESS(CCP4CON,0)
// CCP4CON<CCP4M1>
extern volatile __bit                   CCP4M1              __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 CCP4M1_bit          _BIT_ACCESS(CCP4CON,1)
// CCP4CON<CCP4M2>
extern volatile __bit                   CCP4M2              __at(0x7882);	// @ (0xF10 * 8 + 2)
#define                                 CCP4M2_bit          _BIT_ACCESS(CCP4CON,2)
// CCP4CON<CCP4M3>
