MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
extern volatile __bit                   S07C7               __at(0x7637);	// @ (0xEC6 * 8 + 7)
#define                                 S07C7_bit           _BIT_ACCESS(LCDDATA56,7)
// LCDDATA1<S08C0>
extern volatile __bit                   S08C0               __at(0x7478);	// @ (0xE8F * 8 + 0)
#define                                 S08C0_bit           _BIT_ACCESS(LCDDATA1,0)
// LCDDATA9<S08C1>
extern volatile __bit                   S08C1               __at(0x74B8);	// @ (0xE97 * 8 + 0)
#define                                 S08C1_bit           _BIT_ACCESS(LCDDATA9,0)
// LCDDATA17<S08C2>
extern volatile __bit                   S08C2               __at(0x74F8);	// @ (0xE9F * 8 + 0)
#define                                 S08C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA25<S08C3>
extern volatile __bit                   S08C3               __at(0x7538);	// @ (0xEA7 * 8 + 0)
#define                                 S08C3_bit           _BIT_ACCESS(LCDDATA25,0)
// LCDDATA33<S08C4>
extern volatile __bit                   S08C4               __at(0x7578);	// @ (0xEAF * 8 + 0)
#define                                 S08C4_bit           _BIT_ACCESS(LCDDATA33,0)
// LCDDATA41<S08C5>
extern volatile __bit                   S08C5               __at(0x75B8);	// @ (0xEB7 * 8 + 0)
#define                                 S08C5_bit           _BIT_ACCESS(LCDDATA41,0)
// LCDDATA49<S08C6>
extern volatile __bit                   S08C6               __at(0x75F8);	// @ (0xEBF * 8 + 0)
#define                                 S08C6_bit           _BIT_ACCESS(LCDDATA49,0)
// LCDDATA57<S08C7>
extern volatile __bit                   S08C7               __at(0x7638);	// @ (0xEC7 * 8 + 0)
#define                                 S08C7_bit           _BIT_ACCESS(LCDDATA57,0)
// LCDDATA1<S09C0>
extern volatile __bit                   S09C0               __at(0x7479);	// @ (0xE8F * 8 + 1)
#define                                 S09C0_bit           _BIT_ACCESS(LCDDATA1,1)
// LCDDATA9<S09C1>
extern volatile __bit                   S09C1               __at(0x74B9);	// @ (0xE97 * 8 + 1)
#define                                 S09C1_bit           _BIT_ACCESS(LCDDATA9,1)
// LCDDATA17<S09C2>
extern volatile __bit                   S09C2               __at(0x74F9);	// @ (0xE9F * 8 + 1)
#define                                 S09C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA25<S09C3>
extern volatile __bit                   S09C3               __at(0x7539);	// @ (0xEA7 * 8 + 1)
#define                                 S09C3_bit           _BIT_ACCESS(LCDDATA25,1)
// LCDDATA33<S09C4>
extern volatile __bit                   S09C4               __at(0x7579);	// @ (0xEAF * 8 + 1)
#define                                 S09C4_bit           _BIT_ACCESS(LCDDATA33,1)
// LCDDATA41<S09C5>
extern volatile __bit                   S09C5               __at(0x75B9);	// @ (0xEB7 * 8 + 1)
#define                                 S09C5_bit           _BIT_ACCESS(LCDDATA41,1)
// LCDDATA49<S09C6>
extern volatile __bit                   S09C6               __at(0x75F9);	// @ (0xEBF * 8 + 1)
#define                                 S09C6_bit           _BIT_ACCESS(LCDDATA49,1)
// LCDDATA57<S09C7>
extern volatile __bit                   S09C7               __at(0x7639);	// @ (0xEC7 * 8 + 1)
#define                                 S09C7_bit           _BIT_ACCESS(LCDDATA57,1)
// LCDDATA1<S10C0>
extern volatile __bit                   S10C0               __at(0x747A);	// @ (0xE8F * 8 + 2)
#define                                 S10C0_bit           _BIT_ACCESS(LCDDATA1,2)
// LCDDATA9<S10C1>
extern volatile __bit                   S10C1               __at(0x74BA);	// @ (0xE97 * 8 + 2)
#define                                 S10C1_bit           _BIT_ACCESS(LCDDATA9,2)
// LCDDATA17<S10C2>
extern volatile __bit                   S10C2               __at(0x74FA);	// @ (0xE9F * 8 + 2)
#define                                 S10C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA25<S10C3>
extern volatile __bit                   S10C3               __at(0x753A);	// @ (0xEA7 * 8 + 2)
#define                                 S10C3_bit           _BIT_ACCESS(LCDDATA25,2)
// LCDDATA33<S10C4>
extern volatile __bit                   S10C4               __at(0x757A);	// @ (0xEAF * 8 + 2)
#define                                 S10C4_bit           _BIT_ACCESS(LCDDATA33,2)
// LCDDATA41<S10C5>
extern volatile __bit                   S10C5               __at(0x75BA);	// @ (0xEB7 * 8 + 2)
#define                                 S10C5_bit           _BIT_ACCESS(LCDDATA41,2)
// LCDDATA49<S10C6>
extern volatile __bit                   S10C6               __at(0x75FA);	// @ (0xEBF * 8 + 2)
#define                                 S10C6_bit           _BIT_ACCESS(LCDDATA49,2)
// LCDDATA57<S10C7>
extern volatile __bit                   S10C7               __at(0x763A);	// @ (0xEC7 * 8 + 2)
#define                                 S10C7_bit           _BIT_ACCESS(LCDDATA57,2)
// LCDDATA1<S11C0>
extern volatile __bit                   S11C0               __at(0x747B);	// @ (0xE8F * 8 + 3)
#define                                 S11C0_bit           _BIT_ACCESS(LCDDATA1,3)
// LCDDATA9<S11C1>
extern volatile __bit                   S11C1               __at(0x74BB);	// @ (0xE97 * 8 + 3)
#define                                 S11C1_bit           _BIT_ACCESS(LCDDATA9,3)
// LCDDATA17<S11C2>
extern volatile __bit                   S11C2               __at(0x74FB);	// @ (0xE9F * 8 + 3)
#define                                 S11C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA25<S11C3>
extern volatile __bit                   S11C3               __at(0x753B);	// @ (0xEA7 * 8 + 3)
#define                                 S11C3_bit           _BIT_ACCESS(LCDDATA25,3)
// LCDDATA33<S11C4>
extern volatile __bit                   S11C4               __at(0x757B);	// @ (0xEAF * 8 + 3)
#define                                 S11C4_bit           _BIT_ACCESS(LCDDATA33,3)
// LCDDATA41<S11C5>
extern volatile __bit                   S11C5               __at(0x75BB);	// @ (0xEB7 * 8 + 3)
#define                                 S11C5_bit           _BIT_ACCESS(LCDDATA41,3)
// LCDDATA49<S11C6>
extern volatile __bit                   S11C6               __at(0x75FB);	// @ (0xEBF * 8 + 3)
#define                                 S11C6_bit           _BIT_ACCESS(LCDDATA49,3)
// LCDDATA57<S11C7>
extern volatile __bit                   S11C7               __at(0x763B);	// @ (0xEC7 * 8 + 3)
#define                                 S11C7_bit           _BIT_ACCESS(LCDDATA57,3)
// LCDDATA1<S12C0>
extern volatile __bit                   S12C0               __at(0x747C);	// @ (0xE8F * 8 + 4)
#define                                 S12C0_bit           _BIT_ACCESS(LCDDATA1,4)
// LCDDATA9<S12C1>
extern volatile __bit                   S12C1               __at(0x74BC);	// @ (0xE97 * 8 + 4)
#define                                 S12C1_bit           _BIT_ACCESS(LCDDATA9,4)
// LCDDATA17<S12C2>
extern volatile __bit                   S12C2               __at(0x74FC);	// @ (0xE9F * 8 + 4)
#define                                 S12C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA25<S12C3>
extern volatile __bit                   S12C3               __at(0x753C);	// @ (0xEA7 * 8 + 4)
#define                                 S12C3_bit           _BIT_ACCESS(LCDDATA25,4)
// LCDDATA33<S12C4>
extern volatile __bit                   S12C4               __at(0x757C);	// @ (0xEAF * 8 + 4)
#define                                 S12C4_bit           _BIT_ACCESS(LCDDATA33,4)
// LCDDATA41<S12C5>
extern volatile __bit                   S12C5               __at(0x75BC);	// @ (0xEB7 * 8 + 4)
#define                                 S12C5_bit           _BIT_ACCESS(LCDDATA41,4)
// LCDDATA49<S12C6>
extern volatile __bit                   S12C6               __at(0x75FC);	// @ (0xEBF * 8 + 4)
#define                                 S12C6_bit           _BIT_ACCESS(LCDDATA49,4)
// LCDDATA57<S12C7>
extern volatile __bit                   S12C7               __at(0x763C);	// @ (0xEC7 * 8 + 4)
#define                                 S12C7_bit           _BIT_ACCESS(LCDDATA57,4)
// LCDDATA1<S13C0>
extern volatile __bit                   S13C0               __at(0x747D);	// @ (0xE8F * 8 + 5)
#define                                 S13C0_bit           _BIT_ACCESS(LCDDATA1,5)
// LCDDATA9<S13C1>
extern volatile __bit                   S13C1               __at(0x74BD);	// @ (0xE97 * 8 + 5)
#define                                 S13C1_bit           _BIT_ACCESS(LCDDATA9,5)
// LCDDATA17<S13C2>
extern volatile __bit                   S13C2               __at(0x74FD);	// @ (0xE9F * 8 + 5)
#define                                 S13C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA25<S13C3>
extern volatile __bit                   S13C3               __at(0x753D);	// @ (0xEA7 * 8 + 5)
#define                                 S13C3_bit           _BIT_ACCESS(LCDDATA25,5)
// LCDDATA33<S13C4>
extern volatile __bit                   S13C4               __at(0x757D);	// @ (0xEAF * 8 + 5)
#define                                 S13C4_bit           _BIT_ACCESS(LCDDATA33,5)
// LCDDATA41<S13C5>
extern volatile __bit                   S13C5               __at(0x75BD);	// @ (0xEB7 * 8 + 5)
#define                                 S13C5_bit           _BIT_ACCESS(LCDDATA41,5)
// LCDDATA49<S13C6>
extern volatile __bit                   S13C6               __at(0x75FD);	// @ (0xEBF * 8 + 5)
#define                                 S13C6_bit           _BIT_ACCESS(LCDDATA49,5)
// LCDDATA57<S13C7>
extern volatile __bit                   S13C7               __at(0x763D);	// @ (0xEC7 * 8 + 5)
#define                                 S13C7_bit           _BIT_ACCESS(LCDDATA57,5)
// LCDDATA1<S14C0>
extern volatile __bit                   S14C0               __at(0x747E);	// @ (0xE8F * 8 + 6)
#define                                 S14C0_bit           _BIT_ACCESS(LCDDATA1,6)
// LCDDATA9<S14C1>
extern volatile __bit                   S14C1               __at(0x74BE);	// @ (0xE97 * 8 + 6)
#define                                 S14C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA17<S14C2>
extern volatile __bit                   S14C2               __at(0x74FE);	// @ (0xE9F * 8 + 6)
#define                                 S14C2_bit           _BIT_ACCESS(LCDDATA17,6)
// LCDDATA25<S14C3>
extern volatile __bit                   S14C3               __at(0x753E);	// @ (0xEA7 * 8 + 6)
#define                                 S14C3_bit           _BIT_ACCESS(LCDDATA25,6)
// LCDDATA33<S14C4>
extern volatile __bit                   S14C4               __at(0x757E);	// @ (0xEAF * 8 + 6)
#define                                 S14C4_bit           _BIT_ACCESS(LCDDATA33,6)
// LCDDATA41<S14C5>
extern volatile __bit                   S14C5               __at(0x75BE);	// @ (0xEB7 * 8 + 6)
#define                                 S14C5_bit           _BIT_ACCESS(LCDDATA41,6)
// LCDDATA49<S14C6>
extern volatile __bit                   S14C6               __at(0x75FE);	// @ (0xEBF * 8 + 6)
#define                                 S14C6_bit           _BIT_ACCESS(LCDDATA49,6)
// LCDDATA57<S14C7>
extern volatile __bit                   S14C7               __at(0x763E);	// @ (0xEC7 * 8 + 6)
#define                                 S14C7_bit           _BIT_ACCESS(LCDDATA57,6)
// LCDDATA1<S15C0>
extern volatile __bit                   S15C0               __at(0x747F);	// @ (0xE8F * 8 + 7)
#define                                 S15C0_bit           _BIT_ACCESS(LCDDATA1,7)
// LCDDATA9<S15C1>
extern volatile __bit                   S15C1               __at(0x74BF);	// @ (0xE97 * 8 + 7)
#define                                 S15C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA17<S15C2>
extern volatile __bit                   S15C2               __at(0x74FF);	// @ (0xE9F * 8 + 7)
#define                                 S15C2_bit           _BIT_ACCESS(LCDDATA17,7)
// LCDDATA25<S15C3>
extern volatile __bit                   S15C3               __at(0x753F);	// @ (0xEA7 * 8 + 7)
#define                                 S15C3_bit           _BIT_ACCESS(LCDDATA25,7)
// LCDDATA33<S15C4>
extern volatile __bit                   S15C4               __at(0x757F);	// @ (0xEAF * 8 + 7)
#define                                 S15C4_bit           _BIT_ACCESS(LCDDATA33,7)
// LCDDATA41<S15C5>
extern volatile __bit                   S15C5               __at(0x75BF);	// @ (0xEB7 * 8 + 7)
#define                                 S15C5_bit           _BIT_ACCESS(LCDDATA41,7)
// LCDDATA49<S15C6>
extern volatile __bit                   S15C6               __at(0x75FF);	// @ (0xEBF * 8 + 7)
#define                                 S15C6_bit           _BIT_ACCESS(LCDDATA49,7)
// LCDDATA57<S15C7>
extern volatile __bit                   S15C7               __at(0x763F);	// @ (0xEC7 * 8 + 7)
#define                                 S15C7_bit           _BIT_ACCESS(LCDDATA57,7)
// LCDDATA2<S16C0>
extern volatile __bit                   S16C0               __at(0x7480);	// @ (0xE90 * 8 + 0)
#define                                 S16C0_bit           _BIT_ACCESS(LCDDATA2,0)
// LCDDATA10<S16C1>
extern volatile __bit                   S16C1               __at(0x74C0);	// @ (0xE98 * 8 + 0)
#define                                 S16C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA18<S16C2>
extern volatile __bit                   S16C2               __at(0x7500);	// @ (0xEA0 * 8 + 0)
#define                                 S16C2_bit           _BIT_ACCESS(LCDDATA18,0)
// LCDDATA26<S16C3>
extern volatile __bit                   S16C3               __at(0x7540);	// @ (0xEA8 * 8 + 0)
#define                                 S16C3_bit           _BIT_ACCESS(LCDDATA26,0)
// LCDDATA34<S16C4>
extern volatile __bit                   S16C4               __at(0x7580);	// @ (0xEB0 * 8 + 0)
#define                                 S16C4_bit           _BIT_ACCESS(LCDDATA34,0)
// LCDDATA42<S16C5>
extern volatile __bit                   S16C5               __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 S16C5_bit           _BIT_ACCESS(LCDDATA42,0)
// LCDDATA50<S16C6>
extern volatile __bit                   S16C6               __at(0x7600);	// @ (0xEC0 * 8 + 0)
#define                                 S16C6_bit           _BIT_ACCESS(LCDDATA50,0)
// LCDDATA58<S16C7>
extern volatile __bit                   S16C7               __at(0x7640);	// @ (0xEC8 * 8 + 0)
#define                                 S16C7_bit           _BIT_ACCESS(LCDDATA58,0)
// LCDDATA2<S17C0>
extern volatile __bit                   S17C0               __at(0x7481);	// @ (0xE90 * 8 + 1)
#define                                 S17C0_bit           _BIT_ACCESS(LCDDATA2,1)
// LCDDATA10<S17C1>
extern volatile __bit                   S17C1               __at(0x74C1);	// @ (0xE98 * 8 + 1)
#define                                 S17C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA18<S17C2>
extern volatile __bit                   S17C2               __at(0x7501);	// @ (0xEA0 * 8 + 1)
#define                                 S17C2_bit           _BIT_ACCESS(LCDDATA18,1)
// LCDDATA26<S17C3>
extern volatile __bit                   S17C3               __at(0x7541);	// @ (0xEA8 * 8 + 1)
#define                                 S17C3_bit           _BIT_ACCESS(LCDDATA26,1)
// LCDDATA34<S17C4>
extern volatile __bit                   S17C4               __at(0x7581);	// @ (0xEB0 * 8 + 1)
#define                                 S17C4_bit           _BIT_ACCESS(LCDDATA34,1)
// LCDDATA42<S17C5>
extern volatile __bit                   S17C5               __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 S17C5_bit           _BIT_ACCESS(LCDDATA42,1)
// LCDDATA50<S17C6>
extern volatile __bit                   S17C6               __at(0x7601);	// @ (0xEC0 * 8 + 1)
#define                                 S17C6_bit           _BIT_ACCESS(LCDDATA50,1)
// LCDDATA58<S17C7>
extern volatile __bit                   S17C7               __at(0x7641);	// @ (0xEC8 * 8 + 1)
#define                                 S17C7_bit           _BIT_ACCESS(LCDDATA58,1)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0x7482);	// @ (0xE90 * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA10<S18C1>
extern volatile __bit                   S18C1               __at(0x74C2);	// @ (0xE98 * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA18<S18C2>
extern volatile __bit                   S18C2               __at(0x7502);	// @ (0xEA0 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA18,2)
// LCDDATA26<S18C3>
extern volatile __bit                   S18C3               __at(0x7542);	// @ (0xEA8 * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA26,2)
// LCDDATA34<S18C4>
extern volatile __bit                   S18C4               __at(0x7582);	// @ (0xEB0 * 8 + 2)
#define                                 S18C4_bit           _BIT_ACCESS(LCDDATA34,2)
// LCDDATA42<S18C5>
extern volatile __bit                   S18C5               __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 S18C5_bit           _BIT_ACCESS(LCDDATA42,2)
// LCDDATA50<S18C6>
extern volatile __bit                   S18C6               __at(0x7602);	// @ (0xEC0 * 8 + 2)
#define                                 S18C6_bit           _BIT_ACCESS(LCDDATA50,2)
// LCDDATA58<S18C7>
extern volatile __bit                   S18C7               __at(0x7642);	// @ (0xEC8 * 8 + 2)
#define                                 S18C7_bit           _BIT_ACCESS(LCDDATA58,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0x7483);	// @ (0xE90 * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA10<S19C1>
extern volatile __bit                   S19C1               __at(0x74C3);	// @ (0xE98 * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA18<S19C2>
extern volatile __bit                   S19C2               __at(0x7503);	// @ (0xEA0 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA18,3)
// LCDDATA26<S19C3>
extern volatile __bit                   S19C3               __at(0x7543);	// @ (0xEA8 * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA26,3)
// LCDDATA34<S19C4>
extern volatile __bit                   S19C4               __at(0x7583);	// @ (0xEB0 * 8 + 3)
#define                                 S19C4_bit           _BIT_ACCESS(LCDDATA34,3)
// LCDDATA42<S19C5>
extern volatile __bit                   S19C5               __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 S19C5_bit           _BIT_ACCESS(LCDDATA42,3)
// LCDDATA50<S19C6>
extern volatile __bit                   S19C6               __at(0x7603);	// @ (0xEC0 * 8 + 3)
#define                                 S19C6_bit           _BIT_ACCESS(LCDDATA50,3)
// LCDDATA58<S19C7>
extern volatile __bit                   S19C7               __at(0x7643);	// @ (0xEC8 * 8 + 3)
#define                                 S19C7_bit           _BIT_ACCESS(LCDDATA58,3)
// LCDDATA2<S20C0>
extern volatile __bit                   S20C0               __at(0x7484);	// @ (0xE90 * 8 + 4)
#define                                 S20C0_bit           _BIT_ACCESS(LCDDATA2,4)
// LCDDATA10<S20C1>
extern volatile __bit                   S20C1               __at(0x74C4);	// @ (0xE98 * 8 + 4)
#define                                 S20C1_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA18<S20C2>
extern volatile __bit                   S20C2               __at(0x7504);	// @ (0xEA0 * 8 + 4)
#define                                 S20C2_bit           _BIT_ACCESS(LCDDATA18,4)
// LCDDATA26<S20C3>
extern volatile __bit                   S20C3               __at(0x7544);	// @ (0xEA8 * 8 + 4)
#define                                 S20C3_bit           _BIT_ACCESS(LCDDATA26,4)
// LCDDATA34<S20C4>
extern volatile __bit                   S20C4               __at(0x7584);	// @ (0xEB0 * 8 + 4)
#define                                 S20C4_bit           _BIT_ACCESS(LCDDATA34,4)
// LCDDATA42<S20C5>
extern volatile __bit                   S20C5               __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 S20C5_bit           _BIT_ACCESS(LCDDATA42,4)
// LCDDATA50<S20C6>
extern volatile __bit                   S20C6               __at(0x7604);	// @ (0xEC0 * 8 + 4)
#define                                 S20C6_bit           _BIT_ACCESS(LCDDATA50,4)
// LCDDATA58<S20C7>
extern volatile __bit                   S20C7               __at(0x7644);	// @ (0xEC8 * 8 + 4)
#define                                 S20C7_bit           _BIT_ACCESS(LCDDATA58,4)
// LCDDATA2<S21C0>
extern volatile __bit                   S21C0               __at(0x7485);	// @ (0xE90 * 8 + 5)
#define                                 S21C0_bit           _BIT_ACCESS(LCDDATA2,5)
// LCDDATA10<S21C1>
extern volatile __bit                   S21C1               __at(0x74C5);	// @ (0xE98 * 8 + 5)
#define                                 S21C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA18<S21C2>
extern volatile __bit                   S21C2               __at(0x7505);	// @ (0xEA0 * 8 + 5)
#define                                 S21C2_bit           _BIT_ACCESS(LCDDATA18,5)
// LCDDATA26<S21C3>
extern volatile __bit                   S21C3               __at(0x7545);	// @ (0xEA8 * 8 + 5)
#define                                 S21C3_bit           _BIT_ACCESS(LCDDATA26,5)
// LCDDATA34<S21C4>
extern volatile __bit                   S21C4               __at(0x7585);	// @ (0xEB0 * 8 + 5)
#define                                 S21C4_bit           _BIT_ACCESS(LCDDATA34,5)
// LCDDATA42<S21C5>
extern volatile __bit                   S21C5               __at(0x75C5);	// @ (0xEB8 * 8 + 5)
#define                                 S21C5_bit           _BIT_ACCESS(LCDDATA42,5)
// LCDDATA50<S21C6>
extern volatile __bit                   S21C6               __at(0x7605);	// @ (0xEC0 * 8 + 5)
#define                                 S21C6_bit           _BIT_ACCESS(LCDDATA50,5)
// LCDDATA58<S21C7>
extern volatile __bit                   S21C7               __at(0x7645);	// @ (0xEC8 * 8 + 5)
#define                                 S21C7_bit           _BIT_ACCESS(LCDDATA58,5)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0x7486);	// @ (0xE90 * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA10<S22C1>
extern volatile __bit                   S22C1               __at(0x74C6);	// @ (0xE98 * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA18<S22C2>
extern volatile __bit                   S22C2               __at(0x7506);	// @ (0xEA0 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA18,6)
// LCDDATA26<S22C3>
extern volatile __bit                   S22C3               __at(0x7546);	// @ (0xEA8 * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA26,6)
// LCDDATA34<S22C4>
extern volatile __bit                   S22C4               __at(0x7586);	// @ (0xEB0 * 8 + 6)
#define                                 S22C4_bit           _BIT_ACCESS(LCDDATA34,6)
// LCDDATA42<S22C5>
extern volatile __bit                   S22C5               __at(0x75C6);	// @ (0xEB8 * 8 + 6)
#define                                 S22C5_bit           _BIT_ACCESS(LCDDATA42,6)
// LCDDATA50<S22C6>
extern volatile __bit                   S22C6               __at(0x7606);	// @ (0xEC0 * 8 + 6)
#define                                 S22C6_bit           _BIT_ACCESS(LCDDATA50,6)
// LCDDATA58<S22C7>
