MikroElektronika/core_packages/PIC/XC8/def/PIC18F96J99/mcu.h
extern volatile __bit                   S52C6               __at(0x7624);	// @ (0xEC4 * 8 + 4)
#define                                 S52C6_bit           _BIT_ACCESS(LCDDATA54,4)
// LCDDATA62<S52C7>
extern volatile __bit                   S52C7               __at(0x7664);	// @ (0xECC * 8 + 4)
#define                                 S52C7_bit           _BIT_ACCESS(LCDDATA62,4)
// LCDDATA6<S53C0>
extern volatile __bit                   S53C0               __at(0x74A5);	// @ (0xE94 * 8 + 5)
#define                                 S53C0_bit           _BIT_ACCESS(LCDDATA6,5)
// LCDDATA14<S53C1>
extern volatile __bit                   S53C1               __at(0x74E5);	// @ (0xE9C * 8 + 5)
#define                                 S53C1_bit           _BIT_ACCESS(LCDDATA14,5)
// LCDDATA22<S53C2>
extern volatile __bit                   S53C2               __at(0x7525);	// @ (0xEA4 * 8 + 5)
#define                                 S53C2_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA30<S53C3>
extern volatile __bit                   S53C3               __at(0x7565);	// @ (0xEAC * 8 + 5)
#define                                 S53C3_bit           _BIT_ACCESS(LCDDATA30,5)
// LCDDATA38<S53C4>
extern volatile __bit                   S53C4               __at(0x75A5);	// @ (0xEB4 * 8 + 5)
#define                                 S53C4_bit           _BIT_ACCESS(LCDDATA38,5)
// LCDDATA46<S53C5>
extern volatile __bit                   S53C5               __at(0x75E5);	// @ (0xEBC * 8 + 5)
#define                                 S53C5_bit           _BIT_ACCESS(LCDDATA46,5)
// LCDDATA54<S53C6>
extern volatile __bit                   S53C6               __at(0x7625);	// @ (0xEC4 * 8 + 5)
#define                                 S53C6_bit           _BIT_ACCESS(LCDDATA54,5)
// LCDDATA62<S53C7>
extern volatile __bit                   S53C7               __at(0x7665);	// @ (0xECC * 8 + 5)
#define                                 S53C7_bit           _BIT_ACCESS(LCDDATA62,5)
// LCDDATA6<S54C0>
extern volatile __bit                   S54C0               __at(0x74A6);	// @ (0xE94 * 8 + 6)
#define                                 S54C0_bit           _BIT_ACCESS(LCDDATA6,6)
// LCDDATA14<S54C1>
extern volatile __bit                   S54C1               __at(0x74E6);	// @ (0xE9C * 8 + 6)
#define                                 S54C1_bit           _BIT_ACCESS(LCDDATA14,6)
// LCDDATA22<S54C2>
extern volatile __bit                   S54C2               __at(0x7526);	// @ (0xEA4 * 8 + 6)
#define                                 S54C2_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA30<S54C3>
extern volatile __bit                   S54C3               __at(0x7566);	// @ (0xEAC * 8 + 6)
#define                                 S54C3_bit           _BIT_ACCESS(LCDDATA30,6)
// LCDDATA38<S54C4>
extern volatile __bit                   S54C4               __at(0x75A6);	// @ (0xEB4 * 8 + 6)
#define                                 S54C4_bit           _BIT_ACCESS(LCDDATA38,6)
// LCDDATA46<S54C5>
extern volatile __bit                   S54C5               __at(0x75E6);	// @ (0xEBC * 8 + 6)
#define                                 S54C5_bit           _BIT_ACCESS(LCDDATA46,6)
// LCDDATA54<S54C6>
extern volatile __bit                   S54C6               __at(0x7626);	// @ (0xEC4 * 8 + 6)
#define                                 S54C6_bit           _BIT_ACCESS(LCDDATA54,6)
// LCDDATA62<S54C7>
extern volatile __bit                   S54C7               __at(0x7666);	// @ (0xECC * 8 + 6)
#define                                 S54C7_bit           _BIT_ACCESS(LCDDATA62,6)
// LCDDATA6<S55C0>
extern volatile __bit                   S55C0               __at(0x74A7);	// @ (0xE94 * 8 + 7)
#define                                 S55C0_bit           _BIT_ACCESS(LCDDATA6,7)
// LCDDATA14<S55C1>
extern volatile __bit                   S55C1               __at(0x74E7);	// @ (0xE9C * 8 + 7)
#define                                 S55C1_bit           _BIT_ACCESS(LCDDATA14,7)
// LCDDATA22<S55C2>
extern volatile __bit                   S55C2               __at(0x7527);	// @ (0xEA4 * 8 + 7)
#define                                 S55C2_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA30<S55C3>
extern volatile __bit                   S55C3               __at(0x7567);	// @ (0xEAC * 8 + 7)
#define                                 S55C3_bit           _BIT_ACCESS(LCDDATA30,7)
// LCDDATA38<S55C4>
extern volatile __bit                   S55C4               __at(0x75A7);	// @ (0xEB4 * 8 + 7)
#define                                 S55C4_bit           _BIT_ACCESS(LCDDATA38,7)
// LCDDATA46<S55C5>
extern volatile __bit                   S55C5               __at(0x75E7);	// @ (0xEBC * 8 + 7)
#define                                 S55C5_bit           _BIT_ACCESS(LCDDATA46,7)
// LCDDATA54<S55C6>
extern volatile __bit                   S55C6               __at(0x7627);	// @ (0xEC4 * 8 + 7)
#define                                 S55C6_bit           _BIT_ACCESS(LCDDATA54,7)
// LCDDATA62<S55C7>
extern volatile __bit                   S55C7               __at(0x7667);	// @ (0xECC * 8 + 7)
#define                                 S55C7_bit           _BIT_ACCESS(LCDDATA62,7)
// LCDDATA7<S56C0>
extern volatile __bit                   S56C0               __at(0x74A8);	// @ (0xE95 * 8 + 0)
#define                                 S56C0_bit           _BIT_ACCESS(LCDDATA7,0)
// LCDDATA15<S56C1>
extern volatile __bit                   S56C1               __at(0x74E8);	// @ (0xE9D * 8 + 0)
#define                                 S56C1_bit           _BIT_ACCESS(LCDDATA15,0)
// LCDDATA23<S56C2>
extern volatile __bit                   S56C2               __at(0x7528);	// @ (0xEA5 * 8 + 0)
#define                                 S56C2_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA31<S56C3>
extern volatile __bit                   S56C3               __at(0x7568);	// @ (0xEAD * 8 + 0)
#define                                 S56C3_bit           _BIT_ACCESS(LCDDATA31,0)
// LCDDATA39<S56C4>
extern volatile __bit                   S56C4               __at(0x75A8);	// @ (0xEB5 * 8 + 0)
#define                                 S56C4_bit           _BIT_ACCESS(LCDDATA39,0)
// LCDDATA47<S56C5>
extern volatile __bit                   S56C5               __at(0x75E8);	// @ (0xEBD * 8 + 0)
#define                                 S56C5_bit           _BIT_ACCESS(LCDDATA47,0)
// LCDDATA55<S56C6>
extern volatile __bit                   S56C6               __at(0x7628);	// @ (0xEC5 * 8 + 0)
#define                                 S56C6_bit           _BIT_ACCESS(LCDDATA55,0)
// LCDDATA63<S56C7>
extern volatile __bit                   S56C7               __at(0x7668);	// @ (0xECD * 8 + 0)
#define                                 S56C7_bit           _BIT_ACCESS(LCDDATA63,0)
// LCDDATA7<S57C0>
extern volatile __bit                   S57C0               __at(0x74A9);	// @ (0xE95 * 8 + 1)
#define                                 S57C0_bit           _BIT_ACCESS(LCDDATA7,1)
// LCDDATA15<S57C1>
extern volatile __bit                   S57C1               __at(0x74E9);	// @ (0xE9D * 8 + 1)
#define                                 S57C1_bit           _BIT_ACCESS(LCDDATA15,1)
// LCDDATA23<S57C2>
extern volatile __bit                   S57C2               __at(0x7529);	// @ (0xEA5 * 8 + 1)
#define                                 S57C2_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA31<S57C3>
extern volatile __bit                   S57C3               __at(0x7569);	// @ (0xEAD * 8 + 1)
#define                                 S57C3_bit           _BIT_ACCESS(LCDDATA31,1)
// LCDDATA39<S57C4>
extern volatile __bit                   S57C4               __at(0x75A9);	// @ (0xEB5 * 8 + 1)
#define                                 S57C4_bit           _BIT_ACCESS(LCDDATA39,1)
// LCDDATA47<S57C5>
extern volatile __bit                   S57C5               __at(0x75E9);	// @ (0xEBD * 8 + 1)
#define                                 S57C5_bit           _BIT_ACCESS(LCDDATA47,1)
// LCDDATA55<S57C6>
extern volatile __bit                   S57C6               __at(0x7629);	// @ (0xEC5 * 8 + 1)
#define                                 S57C6_bit           _BIT_ACCESS(LCDDATA55,1)
// LCDDATA63<S57C7>
extern volatile __bit                   S57C7               __at(0x7669);	// @ (0xECD * 8 + 1)
#define                                 S57C7_bit           _BIT_ACCESS(LCDDATA63,1)
// LCDDATA7<S58C0>
extern volatile __bit                   S58C0               __at(0x74AA);	// @ (0xE95 * 8 + 2)
#define                                 S58C0_bit           _BIT_ACCESS(LCDDATA7,2)
// LCDDATA15<S58C1>
extern volatile __bit                   S58C1               __at(0x74EA);	// @ (0xE9D * 8 + 2)
#define                                 S58C1_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA23<S58C2>
extern volatile __bit                   S58C2               __at(0x752A);	// @ (0xEA5 * 8 + 2)
#define                                 S58C2_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA31<S58C3>
extern volatile __bit                   S58C3               __at(0x756A);	// @ (0xEAD * 8 + 2)
#define                                 S58C3_bit           _BIT_ACCESS(LCDDATA31,2)
// LCDDATA39<S58C4>
extern volatile __bit                   S58C4               __at(0x75AA);	// @ (0xEB5 * 8 + 2)
#define                                 S58C4_bit           _BIT_ACCESS(LCDDATA39,2)
// LCDDATA47<S58C5>
extern volatile __bit                   S58C5               __at(0x75EA);	// @ (0xEBD * 8 + 2)
#define                                 S58C5_bit           _BIT_ACCESS(LCDDATA47,2)
// LCDDATA55<S58C6>
extern volatile __bit                   S58C6               __at(0x762A);	// @ (0xEC5 * 8 + 2)
#define                                 S58C6_bit           _BIT_ACCESS(LCDDATA55,2)
// LCDDATA63<S58C7>
extern volatile __bit                   S58C7               __at(0x766A);	// @ (0xECD * 8 + 2)
#define                                 S58C7_bit           _BIT_ACCESS(LCDDATA63,2)
// LCDDATA7<S59C0>
extern volatile __bit                   S59C0               __at(0x74AB);	// @ (0xE95 * 8 + 3)
#define                                 S59C0_bit           _BIT_ACCESS(LCDDATA7,3)
// LCDDATA15<S59C1>
extern volatile __bit                   S59C1               __at(0x74EB);	// @ (0xE9D * 8 + 3)
#define                                 S59C1_bit           _BIT_ACCESS(LCDDATA15,3)
// LCDDATA23<S59C2>
extern volatile __bit                   S59C2               __at(0x752B);	// @ (0xEA5 * 8 + 3)
#define                                 S59C2_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA31<S59C3>
extern volatile __bit                   S59C3               __at(0x756B);	// @ (0xEAD * 8 + 3)
#define                                 S59C3_bit           _BIT_ACCESS(LCDDATA31,3)
// LCDDATA39<S59C4>
extern volatile __bit                   S59C4               __at(0x75AB);	// @ (0xEB5 * 8 + 3)
#define                                 S59C4_bit           _BIT_ACCESS(LCDDATA39,3)
// LCDDATA47<S59C5>
extern volatile __bit                   S59C5               __at(0x75EB);	// @ (0xEBD * 8 + 3)
#define                                 S59C5_bit           _BIT_ACCESS(LCDDATA47,3)
// LCDDATA55<S59C6>
extern volatile __bit                   S59C6               __at(0x762B);	// @ (0xEC5 * 8 + 3)
#define                                 S59C6_bit           _BIT_ACCESS(LCDDATA55,3)
// LCDDATA63<S59C7>
extern volatile __bit                   S59C7               __at(0x766B);	// @ (0xECD * 8 + 3)
#define                                 S59C7_bit           _BIT_ACCESS(LCDDATA63,3)
// LCDDATA7<S60C0>
extern volatile __bit                   S60C0               __at(0x74AC);	// @ (0xE95 * 8 + 4)
#define                                 S60C0_bit           _BIT_ACCESS(LCDDATA7,4)
// LCDDATA15<S60C1>
extern volatile __bit                   S60C1               __at(0x74EC);	// @ (0xE9D * 8 + 4)
#define                                 S60C1_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA23<S60C2>
extern volatile __bit                   S60C2               __at(0x752C);	// @ (0xEA5 * 8 + 4)
#define                                 S60C2_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA31<S60C3>
extern volatile __bit                   S60C3               __at(0x756C);	// @ (0xEAD * 8 + 4)
#define                                 S60C3_bit           _BIT_ACCESS(LCDDATA31,4)
// LCDDATA39<S60C4>
extern volatile __bit                   S60C4               __at(0x75AC);	// @ (0xEB5 * 8 + 4)
#define                                 S60C4_bit           _BIT_ACCESS(LCDDATA39,4)
// LCDDATA47<S60C5>
extern volatile __bit                   S60C5               __at(0x75EC);	// @ (0xEBD * 8 + 4)
#define                                 S60C5_bit           _BIT_ACCESS(LCDDATA47,4)
// LCDDATA55<S60C6>
extern volatile __bit                   S60C6               __at(0x762C);	// @ (0xEC5 * 8 + 4)
#define                                 S60C6_bit           _BIT_ACCESS(LCDDATA55,4)
// LCDDATA63<S60C7>
extern volatile __bit                   S60C7               __at(0x766C);	// @ (0xECD * 8 + 4)
#define                                 S60C7_bit           _BIT_ACCESS(LCDDATA63,4)
// LCDDATA7<S61C0>
extern volatile __bit                   S61C0               __at(0x74AD);	// @ (0xE95 * 8 + 5)
#define                                 S61C0_bit           _BIT_ACCESS(LCDDATA7,5)
// LCDDATA15<S61C1>
extern volatile __bit                   S61C1               __at(0x74ED);	// @ (0xE9D * 8 + 5)
#define                                 S61C1_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA23<S61C2>
extern volatile __bit                   S61C2               __at(0x752D);	// @ (0xEA5 * 8 + 5)
#define                                 S61C2_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA31<S61C3>
extern volatile __bit                   S61C3               __at(0x756D);	// @ (0xEAD * 8 + 5)
#define                                 S61C3_bit           _BIT_ACCESS(LCDDATA31,5)
// LCDDATA39<S61C4>
extern volatile __bit                   S61C4               __at(0x75AD);	// @ (0xEB5 * 8 + 5)
#define                                 S61C4_bit           _BIT_ACCESS(LCDDATA39,5)
// LCDDATA47<S61C5>
extern volatile __bit                   S61C5               __at(0x75ED);	// @ (0xEBD * 8 + 5)
#define                                 S61C5_bit           _BIT_ACCESS(LCDDATA47,5)
// LCDDATA55<S61C6>
extern volatile __bit                   S61C6               __at(0x762D);	// @ (0xEC5 * 8 + 5)
#define                                 S61C6_bit           _BIT_ACCESS(LCDDATA55,5)
// LCDDATA63<S61C7>
extern volatile __bit                   S61C7               __at(0x766D);	// @ (0xECD * 8 + 5)
#define                                 S61C7_bit           _BIT_ACCESS(LCDDATA63,5)
// LCDDATA7<S62C0>
extern volatile __bit                   S62C0               __at(0x74AE);	// @ (0xE95 * 8 + 6)
#define                                 S62C0_bit           _BIT_ACCESS(LCDDATA7,6)
// LCDDATA15<S62C1>
extern volatile __bit                   S62C1               __at(0x74EE);	// @ (0xE9D * 8 + 6)
#define                                 S62C1_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA23<S62C2>
extern volatile __bit                   S62C2               __at(0x752E);	// @ (0xEA5 * 8 + 6)
#define                                 S62C2_bit           _BIT_ACCESS(LCDDATA23,6)
// LCDDATA31<S62C3>
extern volatile __bit                   S62C3               __at(0x756E);	// @ (0xEAD * 8 + 6)
#define                                 S62C3_bit           _BIT_ACCESS(LCDDATA31,6)
// LCDDATA39<S62C4>
extern volatile __bit                   S62C4               __at(0x75AE);	// @ (0xEB5 * 8 + 6)
#define                                 S62C4_bit           _BIT_ACCESS(LCDDATA39,6)
// LCDDATA47<S62C5>
extern volatile __bit                   S62C5               __at(0x75EE);	// @ (0xEBD * 8 + 6)
#define                                 S62C5_bit           _BIT_ACCESS(LCDDATA47,6)
// LCDDATA55<S62C6>
extern volatile __bit                   S62C6               __at(0x762E);	// @ (0xEC5 * 8 + 6)
#define                                 S62C6_bit           _BIT_ACCESS(LCDDATA55,6)
// LCDDATA63<S62C7>
extern volatile __bit                   S62C7               __at(0x766E);	// @ (0xECD * 8 + 6)
#define                                 S62C7_bit           _BIT_ACCESS(LCDDATA63,6)
// LCDDATA7<S63C0>
extern volatile __bit                   S63C0               __at(0x74AF);	// @ (0xE95 * 8 + 7)
#define                                 S63C0_bit           _BIT_ACCESS(LCDDATA7,7)
// LCDDATA15<S63C1>
extern volatile __bit                   S63C1               __at(0x74EF);	// @ (0xE9D * 8 + 7)
#define                                 S63C1_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA23<S63C2>
extern volatile __bit                   S63C2               __at(0x752F);	// @ (0xEA5 * 8 + 7)
#define                                 S63C2_bit           _BIT_ACCESS(LCDDATA23,7)
// LCDDATA31<S63C3>
extern volatile __bit                   S63C3               __at(0x756F);	// @ (0xEAD * 8 + 7)
#define                                 S63C3_bit           _BIT_ACCESS(LCDDATA31,7)
// LCDDATA39<S63C4>
extern volatile __bit                   S63C4               __at(0x75AF);	// @ (0xEB5 * 8 + 7)
#define                                 S63C4_bit           _BIT_ACCESS(LCDDATA39,7)
// LCDDATA47<S63C5>
extern volatile __bit                   S63C5               __at(0x75EF);	// @ (0xEBD * 8 + 7)
#define                                 S63C5_bit           _BIT_ACCESS(LCDDATA47,7)
// LCDDATA55<S63C6>
extern volatile __bit                   S63C6               __at(0x762F);	// @ (0xEC5 * 8 + 7)
#define                                 S63C6_bit           _BIT_ACCESS(LCDDATA55,7)
// LCDDATA63<S63C7>
extern volatile __bit                   S63C7               __at(0x766F);	// @ (0xECD * 8 + 7)
#define                                 S63C7_bit           _BIT_ACCESS(LCDDATA63,7)
// ADCON3H<SAMC0>
extern volatile __bit                   SAMC0               __at(0x7458);	// @ (0xE8B * 8 + 0)
#define                                 SAMC0_bit           _BIT_ACCESS(ADCON3H,0)
// ADCON3H<SAMC1>
extern volatile __bit                   SAMC1               __at(0x7459);	// @ (0xE8B * 8 + 1)
#define                                 SAMC1_bit           _BIT_ACCESS(ADCON3H,1)
// ADCON3H<SAMC2>
extern volatile __bit                   SAMC2               __at(0x745A);	// @ (0xE8B * 8 + 2)
#define                                 SAMC2_bit           _BIT_ACCESS(ADCON3H,2)
// ADCON3H<SAMC3>
extern volatile __bit                   SAMC3               __at(0x745B);	// @ (0xE8B * 8 + 3)
#define                                 SAMC3_bit           _BIT_ACCESS(ADCON3H,3)
// ADCON3H<SAMC4>
extern volatile __bit                   SAMC4               __at(0x745C);	// @ (0xE8B * 8 + 4)
#define                                 SAMC4_bit           _BIT_ACCESS(ADCON3H,4)
// ADCON1L<SAMP>
extern volatile __bit                   SAMP                __at(0x7E01);	// @ (0xFC0 * 8 + 1)
#define                                 SAMP_bit            _BIT_ACCESS(ADCON1L,1)
// RPINR8_9<SCK1R0>
extern volatile __bit                   SCK1R0              __at(0x7170);	// @ (0xE2E * 8 + 0)
#define                                 SCK1R0_bit          _BIT_ACCESS(RPINR8_9,0)
// RPINR8_9<SCK1R1>
extern volatile __bit                   SCK1R1              __at(0x7171);	// @ (0xE2E * 8 + 1)
#define                                 SCK1R1_bit          _BIT_ACCESS(RPINR8_9,1)
// RPINR8_9<SCK1R2>
extern volatile __bit                   SCK1R2              __at(0x7172);	// @ (0xE2E * 8 + 2)
#define                                 SCK1R2_bit          _BIT_ACCESS(RPINR8_9,2)
// RPINR8_9<SCK1R3>
extern volatile __bit                   SCK1R3              __at(0x7173);	// @ (0xE2E * 8 + 3)
#define                                 SCK1R3_bit          _BIT_ACCESS(RPINR8_9,3)
// RPINR10_11<SCK2R0>
extern volatile __bit                   SCK2R0              __at(0x717C);	// @ (0xE2F * 8 + 4)
#define                                 SCK2R0_bit          _BIT_ACCESS(RPINR10_11,4)
// RPINR10_11<SCK2R1>
extern volatile __bit                   SCK2R1              __at(0x717D);	// @ (0xE2F * 8 + 5)
#define                                 SCK2R1_bit          _BIT_ACCESS(RPINR10_11,5)
// RPINR10_11<SCK2R2>
extern volatile __bit                   SCK2R2              __at(0x717E);	// @ (0xE2F * 8 + 6)
#define                                 SCK2R2_bit          _BIT_ACCESS(RPINR10_11,6)
// RPINR10_11<SCK2R3>
extern volatile __bit                   SCK2R3              __at(0x717F);	// @ (0xE2F * 8 + 7)
#define                                 SCK2R3_bit          _BIT_ACCESS(RPINR10_11,7)
// BAUDCON1<SCKP>
extern volatile __bit                   SCKP                __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SCKP_bit            _BIT_ACCESS(BAUDCON1,4)
// BAUDCON1<SCKP1>
extern volatile __bit                   SCKP1               __at(0x7B3C);	// @ (0xF67 * 8 + 4)
#define                                 SCKP1_bit           _BIT_ACCESS(BAUDCON1,4)
// BAUDCON2<SCKP2>
extern volatile __bit                   SCKP2               __at(0x798C);	// @ (0xF31 * 8 + 4)
#define                                 SCKP2_bit           _BIT_ACCESS(BAUDCON2,4)
// BAUDCON3<SCKP3>
extern volatile __bit                   SCKP3               __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 SCKP3_bit           _BIT_ACCESS(BAUDCON3,4)
// BAUDCON4<SCKP4>
extern volatile __bit                   SCKP4               __at(0x77EC);	// @ (0xEFD * 8 + 4)
#define                                 SCKP4_bit           _BIT_ACCESS(BAUDCON4,4)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// RPINR8_9<SDI1R0>
extern volatile __bit                   SDI1R0              __at(0x7174);	// @ (0xE2E * 8 + 4)
#define                                 SDI1R0_bit          _BIT_ACCESS(RPINR8_9,4)
// RPINR8_9<SDI1R1>
extern volatile __bit                   SDI1R1              __at(0x7175);	// @ (0xE2E * 8 + 5)
#define                                 SDI1R1_bit          _BIT_ACCESS(RPINR8_9,5)
// RPINR8_9<SDI1R2>
extern volatile __bit                   SDI1R2              __at(0x7176);	// @ (0xE2E * 8 + 6)
#define                                 SDI1R2_bit          _BIT_ACCESS(RPINR8_9,6)
// RPINR8_9<SDI1R3>
extern volatile __bit                   SDI1R3              __at(0x7177);	// @ (0xE2E * 8 + 7)
#define                                 SDI1R3_bit          _BIT_ACCESS(RPINR8_9,7)
// RPINR12_13<SDI2R0>
extern volatile __bit                   SDI2R0              __at(0x7180);	// @ (0xE30 * 8 + 0)
#define                                 SDI2R0_bit          _BIT_ACCESS(RPINR12_13,0)
// RPINR12_13<SDI2R1>
extern volatile __bit                   SDI2R1              __at(0x7181);	// @ (0xE30 * 8 + 1)
#define                                 SDI2R1_bit          _BIT_ACCESS(RPINR12_13,1)
// RPINR12_13<SDI2R2>
extern volatile __bit                   SDI2R2              __at(0x7182);	// @ (0xE30 * 8 + 2)
#define                                 SDI2R2_bit          _BIT_ACCESS(RPINR12_13,2)
// RPINR12_13<SDI2R3>
extern volatile __bit                   SDI2R3              __at(0x7183);	// @ (0xE30 * 8 + 3)
#define                                 SDI2R3_bit          _BIT_ACCESS(RPINR12_13,3)
// UCON<SE0>
extern volatile __bit                   SE0                 __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 SE0_bit             _BIT_ACCESS(UCON,5)
// LCDSE0<SE00>
extern volatile __bit                   SE00                __at(0x7670);	// @ (0xECE * 8 + 0)
#define                                 SE00_bit            _BIT_ACCESS(LCDSE0,0)
// LCDSE0<SE01>
